[
  {
    "product_name": "Straight Talk Apple iPhone SE (2022-3rd Gen) 5G, 64GB, Midnight - Prepaid Smartphone [Locked to Straight Talk]",
    "rating": "(4.3)",
    "review_count": "2,307 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Straight-Talk-Apple-iPhone-SE-2022-3rd-Gen-5G-64GB-Midnight-Prepaid-Smartphone-Locked-to-Straight-Talk_09ed12de-92c5-449f-8e7f-8125bf5d17d1.c055f1517bd70806914f222dbefb18ef.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/5d0fd714-3240-4497-b1dd-1da685a2b6f8.a1e9ff008e85d9e6f948f813c425619b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/e94a1b84-d506-400f-8dac-b54c9753f0b9.cff7d1573c4da5bdcad5b592a227c9a0.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/b75a74b5-825b-4041-bddc-bc3208eeac25.8aa21dfd56f32adb4426cc27bd08980d.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/002092b5-9ffa-4a70-8767-418f2f0c79cf.00af794200fb2d35fa70c6b12f771f87.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$179.00",
    "description_1_text": "Serious power meets serious value with the iPhone SE in Midnight from Straight Talk. A lightning-fast A15 Bionic chip, 4GB RAM and fast 5G1 connectivity make this the most powerful 4.7-inch2 iPhone ever. Enjoy up to 15 hours3 of video playback on a Retina HD display made from the toughest glass available in a smartphone. Go big with stellar battery life and a superstar camera system featuring a 12MP Wide camera, Smart HDR 4, Photographic Styles, Portrait mode, and 4K video up to 60 fps. Share the moment with friends and family in stunning detail on the 7MP FaceTime HD camera with 1080p video recording. This iPhone is built for life-on-the-go with a durable, IP67 water resistant4 design and a Home button with secure Touch ID. You'll love the power and the possibilities of iOS 15, which packs new features to do more with iPhone than ever before5. Pair it with a no-contract unlimited talk, text & data plan from Straight Talk to keep you connected for less on America's most reliable 5G† Network. Find the Apple iPhone SE (3rd Generation) in Midnight and Straight Talk plans online or in-store at your local Walmart.",
    "description_2_text": " Straight Talk Apple iPhone SE (3rd Generation), 64GB Midnight - Prepaid Smartphone: 5G cellular1        4.7-inch Retina HD display Advanced camera system with 12MP Wide camera, 7MP FaceTime HD camera 4K video recording up to 60 fps A15 Bionic chip Up to 15 hours of video playback Durable design and IP67 water resistance Home button with Touch ID for secure authentication Coverage on America's most reliable 5G† network Compatible with talk, text & data plans from Straight Talk  Pair this phone with a best-selling no-contract Straight Talk plan Learn more about Straight Talk by visiting our Brand Page (1) Data plan required. 5G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on 5G support, contact your carrier and see Apple website (2) Display size is measured diagonally. (3) Battery life varies by use and configuration. See Apple website for more information. (4) iPhone SE (3rd generation) has a rating of IP67 under IEC standard 60529 (maximum depth of 1 meter up to 30 minutes). Splash, water, and dust resistance are not permanent conditions and resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage not covered under warranty. (5) Some features may not be available for all countries or areas Straight Talk utilizes the network with the most first place rankings in RootMetrics® 1H 2023 5G reliability assessments of 125 metros. Results may vary. Not an endorsement. †5G access requires a 5G-capable device in a 5G coverage area. ",
    "reviews": [
      {
        "text": "Brand new Apple iPhone SE 3rd Generation for $199.99 was a good buy. Even though the phone is locked to Straight Talk it is only locked their network for 60 days after activation, they unlock the phone allowing the phone to be used on any compatible network type other than Straight Talk.",
        "rating": 5,
        "author": "Jon",
        "date": ""
      },
      {
        "text": "I really love this phone! I ordered it from Walmart online as a new phone, and it came with its own SIM card and a charger cord. The charger cord was an iPhone to C charger cord and though and I didn't have a base for that kind of cord, I had also ordered a regular iPhone to usb cord to fit my current base since I wasn't sure if it came with one. I've had this phone for about 2 months now and it works great! Data and WiFi network are fast as are the apps. It was super easy to set up and get my current number added to it. I even dropped it in the toilet on accident a few weeks after having it and it still works perfect! It is small, compared to a lot of the other phones on the market right now , but that is one of the reasons I love it, and it fits perfectly in my pocket. I also love that it still has a home button which is hard to find on an iPhone these days! I looked it up, and the iPhone SE 3rd generation came out between the iPhone 13 %26 14. So this is a relatively new model and it was only $150! Can't beat that price! All in all, this is a great phone for the price. I love the fact that it has a home button, is easy to use, and wasn't super expensive.",
        "rating": 5,
        "author": "Sunny",
        "date": ""
      },
      {
        "text": "Great phone This is the 3rd generation I believe it uses same processor as IPhone 10. A big improvement over my 1st generation SE. I would recommend also purchasing screen protector %26 bumper card case. Pleased with performance",
        "rating": 5,
        "author": "Hercules",
        "date": ""
      },
      {
        "text": "Straight talk seems to be in the middle of a take over. Customer service is a joke. Can't do anything on the website. I heard that Verizon bought them, I hope so. Phone is great, actually phone service is great. Just be prepared for no frills or customer service.",
        "rating": 5,
        "author": "Scott",
        "date": ""
      },
      {
        "text": "The best phone ever.   First off I am happy I made the switch to Apple awhile ago.  I am extra happy with the SE.  Why?  It is an affordable (in this economy it matters), user friendly, versatile, quick and full of features. I'm sure there a things this SE does that I have not utilized yet.  Overall, it is a 5+.",
        "rating": 5,
        "author": "HotWheels28",
        "date": ""
      },
      {
        "text": "No issues with the phone itself but i couldn't set it up myself. Had to return it and re- purchase to have an in store associate help me. It wasn't scanned out properly via the ogp so if you need a new phone I suggest just going in and dealing with with the crowd and have an associate help. They are great.",
        "rating": 2,
        "author": "Pete",
        "date": ""
      },
      {
        "text": "I ordered it online so I didn't have to go to the store, but was sent the iPhone that is locked to total by Verizon instead of straight talk. Online help couldn't help me or do anything about it, so I ended up in the store anyways.. this is after the phone arrived three days late as well",
        "rating": 1,
        "author": "ashley",
        "date": ""
      },
      {
        "text": "Do not believe the option of this item being in the store. This is the second phone I have bought, believing they have it in stock, only to get notification at my pick-up time, that it is unavailable. Both of these items were birthday gifts that I was counting on being in-stock (and were purchased in-stock). I am so disappointed that they cannot be straight and tell me that they do not have in the store but can ship. I would have picked the shipping option and had on time if that was the case. Do not believe that you will get this item in the store, even if they advertise it that way. Shame on you Wal-Mart for false advertisement!!  :(",
        "rating": 1,
        "author": "NICKY",
        "date": ""
      },
      {
        "text": "I would review this SE, but Walmart didn't deliver the phone. Then, they didn't even refund the money I spent on the phone either. They are lucky I have no choice but to be their customer because I rely on their delivery services that usually stink for multiple reasons",
        "rating": 1,
        "author": "MagicalCupcake",
        "date": ""
      },
      {
        "text": "my wife is disabled and I travel for a living so when she told me she needed another phone I bought this one online and have them deliver it. she went to set it up and they tell her the person at Walmart rang up the wrong barcode and she has to bring it back.\nWalmart used to be a great place to shop",
        "rating": 1,
        "author": "Bird",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Apple MacBook Air 13.3 inch Laptop - Space Gray, M1 Chip, Built for Apple Intelligence, 8GB RAM, 256GB storage",
    "rating": "(4.7)",
    "review_count": "3,352 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Apple-MacBook-Air-13-3-inch-Laptop-Space-Gray-M1-Chip-8GB-RAM-256GB-storage_af1d4133-6de9-4bdc-b1c6-1ca8bd0af7a0.c0eb74c31b2cb05df4ed11124d0e255b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/dfw/4ff9c6c9-bf09/k2-_529053f3-d044-4eaf-a066-6ef9f573a522.v1.jpg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/6241225e-db0b-44a0-a32f-c3d091feeb06.7efd482507c3842ef01d0073ea27c469.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/0bb6519e-58de-467c-bbb6-183c1377afa8.1e462a14cdd6d2cbd0c097d54540b767.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/898b596c-7fb0-41e4-8cb0-24b3c536db6b.81748360a86f642b4ae1ee7f63516010.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $649.00",
    "description_1_text": "Introducing The 13-inch MacBook Air with the Apple M1 chip is incredibly thin and light with a silent fanless design. It delivers remarkable performance and up to 18 hours of battery life. And it has a beautiful Retina display for super sharp text and vibrant colors. Amazing performance, Unbeatable price. It's a laptop you’re going to love!",
    "description_2_text": " Available in: Gold, Space Gray, and Silver Condition: New Built For Apple Intelligence: Apple Intelligence helps you write, express yourself, and get things done effortlessly. It draws on your personal context while setting a brand-new standard for privacy in AI. Coming in beta this fall. All-Day Battery Life: Go longer than ever with up to 18 hours of battery life. Powerful Performance: Take on everything from professional-quality editing to action-packed gaming with ease. The Apple M1 chip with an 8-core CPU delivers up to 3.5x faster performance than the previous generation while using way less power. Superfast Memory: 8GB of unified memory makes your entire system speedy and responsive. That way it can support tasks like memory-hogging multitab browsing and opening a huge graphic file quickly and easily. Stunning Display: With a 13.3 inch Retina display, images come alive with new levels of realism. Text is sharp and clear, and colors are more vibrant. Fanless Design: Your MacBook Air stays cool and runs quietly even while tackling intense workloads. Simply Compatible: All your existing apps work, including Adobe Creative Cloud, Microsoft 365, and Google Drive. Plus you can use your favorite iPhone and iPad apps directly on macOS. Altogether you'll have access to the biggest collection of apps ever for Mac. All available on the App Store. Easy to Learn: If you already have an iPhone, MacBook Air feels familiar from the moment you turn it on. And it works perfectly with all your Apple devices. Use your iPad to extend the workspace of your Mac, answer texts and phone calls directly on your Mac, and more. AppleCare: Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare plus to extend your coverage and reduce the stress and cost of unexpected repairs. Environmentally Friendly: MacBook Air is made with a 100 percent recycled aluminum enclosure and uses less energy for a smaller carbon footprint. Why Mac: Easy to learn. Easy to set up. Astoundingly powerful. Intuitive. Packed with apps to use right out of the box. Mac is designed to let you work, play, and create like never before. Apple Intelligence will be available in beta on Mac with M1 and later, with Siri and device language set to U.S. English, as part of macOS Sequoia this fall. ",
    "reviews": [
      {
        "text": "The product ordering and the item itself is fine. OnTrac shipping asked for a signature... I also provided written instructions to place the item behind a corner by our front door. Instead, the driver just left it, on the ground, directly in front of the front door, easily visible from the street. Drivers are busy people... but if they aren't reading specific instructions, what is Walmart's liability for package loss?",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "Came in brand new fancy packaging!  I have been wanting one of these forever but couldn't justify the price . I got the silver so it matched my Chromebook when I work side by side. Operating system takes getting used to if you use. Chromebooks but it's easy enough. (CTRL   F is command F and so on...)",
        "rating": 5,
        "author": "emma",
        "date": ""
      },
      {
        "text": "Was worried from seeing reviews by others that Walmart was shipping out refurbished units. Wasn't the case for me. Not crazy about the specs, but for $650 I'm willing to compromise.",
        "rating": 5,
        "author": "Scott",
        "date": ""
      },
      {
        "text": "I had an older Mac Air that the OS became obsolete.   TurboTax wouldn't run on it…lol.   Don't know what I waited so long for.  This thing while a basic Mac air has improved over the years.  Screen size is comparable but the overall size is more compact and a great screen, speed, and overall specs for $699 couldn't be beat.   So this Dad had to upgrade the Air.   At this price pick one up you won't be disappointed.",
        "rating": 5,
        "author": "Kent",
        "date": ""
      },
      {
        "text": "I have wanted a MacBook for awhile. But I couldn't afford one as they usually are very expensive. I definitely couldn't afford a brand brand now one. This might be a generation or two behind but it is a great computer and it was new not refurbished. And the battery life is amazing. My friend who is knowledgeable about Apple products said it was a good deal so I got it. And he was right I love it. The only thing I wish is that it was a touch screen. Lol I keep trying to use it as a touchscreen but it isn't. Definitely would recommend especially if your like me and can't afford a new new one way over $1000, since this was $699",
        "rating": 5,
        "author": "Beth",
        "date": ""
      },
      {
        "text": "Got a good price so I pulled the trigger and bought one. So far, so good. Works as expected, and has a lot of nice on-board features and software. I recommend. ⓹⭐️",
        "rating": 5,
        "author": "Broose",
        "date": ""
      },
      {
        "text": "Overall: A very good price for this model, and I'm really happy in the availability and speed at which I received my order after checkout.  The M1 model is highly reviewed by a lot of trusted critics for just about every average user/consumer, even at the time of this writing. It's slim, lightweight, fast, has good software and excellent battery, which combine to make it a perfect choice for me (small business owner, light creative work %26 working from anywhere).  As it's an older model, many stores won't have this available, and certainly not at this price-point. I'm really happy I made this decision, and Walmart knocked it out of the park by becoming a distributor at this price.  If you're on the fence about this one, don't wait too long.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "We are an Apple family (iPhones, iPads, MacBooks). My daughter is leaving for college next month, so she won't be able to borrow my wife's MacBook for her schoolwork. I was excited to see Walmart become the distributor for the **** M1 MacBook Air. Apple has moved on to focus on their M2 and M3 chip offerings, but the M1 is still a great machine, especially for a college student. It was already a great price at $****, but with it on sale for $****, it was too good to pass up! I was grateful I could afford it. Thanks again!",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "Fedex delivered my package to the wrong door I opened a case with them called Walmart their supervisor hung up in my face and stated he had my signature in front of his face and was rude and disgusting. This is the image fedex provided NOT MY SIGNATURE and I provided my RING CAM FOOTAGE. Never ordering electronics online from here again. Disputing with my bank as well as filing a police report and formal complaint with Walmart Delivery for how I was treated even as an employee.",
        "rating": 1,
        "author": "Ronisha",
        "date": ""
      },
      {
        "text": "NOT NEW! This is my second attempt on receiving a new MacBook Air this time I received it in basic Walmart bag no plastic seal around package so I opened it while the driver was there looked inside the laptop didn't have it out. The bottom was all scratched up they definitely did a deal with Apple and are selling all of their returned damaged MacBooks. And for the Walmart rep, when you read this, I will delete this review when you make it right",
        "rating": 1,
        "author": "Adrian",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Nintendo OLED w/ White Joy-Con White, Nintendo Switch",
    "rating": "Not found",
    "review_count": "2,026 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Nintendo-OLED-w-White-Joy-Con-White-Nintendo-Switch_c22aa8c1-bf4f-483d-a9ca-4d859a76301b.438540fe549cef8f553dbb7628d10a2f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://content.syndigo.com/asset/1e667a5d-7e57-40fc-b0b2-6a72f4d689c3/960.jpg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/d1e53b4c-ffbb-4f83-85b4-df460aff5aec.0fe3b7c4ae56df145a389fdbec6efe02.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/26c4e8ea-daeb-4c29-8c79-2c3a2a7f2200.d5b19785941a6203528a6c81956d5f34.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/064eea1a-e4bf-41ba-be9c-620f04eb4d1e.46a5ae63a61164502347753db6f17cda.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/1def1d84-3c98-49f9-9338-dd0581bcaaf8.0fa598973c97c9cee7767aa2b4b10a8c.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $309.50",
    "description_1_text": "Introducing the newest member of the Nintendo Switch family  Play at home on the TV or on-the-go with a vibrant 7-inch OLED screen with the Nintendo Switch™ – OLED Model system. In addition to a new screen with vivid colors and sharp contrast, the Nintendo Switch– OLED Model includes a wide adjustable stand for more comfortable viewing angles, a dock with a wired LAN port for TV mode (LAN cable sold separately), 64GB of internal storage, and enhanced audio in Handheld and Tabletop modes using the system’s speakers.  *There may be software where the game experience may differ due to the new capabilities of the system, such as the larger screen size.",
    "description_2_text": " 7-inch OLED screen - Enjoy vivid colors and crisp contrast with a screen that makes colors pop Wide adjustable stand – Freely angle the system’s wide, adjustable stand for comfortable viewing in Tabletop mode Wired LAN port - Use the dock’s LAN port when playing in TV mode for a wired internet connection 64 GB internal storage - Save games to your system with 64 GB of internal storage Enhanced audio – Enjoy enhanced sound from the system’s onboard speakers when playing in Handheld and Tabletop modes Supports all Joy-Con™ controllers and Nintendo Switch software*          ",
    "reviews": [
      {
        "text": "The price was drastically lower than other websites and services. The lower price was what I considered and opted to get the newer version of this item instead of the older model. I may have spent a little more on the newer model but I justified the purchase because it was not as expensive as other websites.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "I bought this as a upgrade from my original switch. This switch is amazing after unboxing and setting up it transfers my saved game data from my old switch to my new switch. And it loads my games so much faster than my old switch. I will keep my old switch as a backup incase i need to send this in for repairs. One awesome thing i enjoy about this nintendo switch OLED dock has a wired Internet LAN port to where i can hookup wired LAN from my modem to the dock. Less hassle on wireless network connection. The dock and joycons OLED look awesome just like a PS5",
        "rating": 5,
        "author": "jonathan",
        "date": ""
      },
      {
        "text": "Arrived earlier than given date. No damage to product or package as well. Very satisfied with the shipping and with the product itself. Been wanting an OLED switch for a while and jumped when it went on sale here.",
        "rating": 5,
        "author": "Kat",
        "date": ""
      },
      {
        "text": "I got exactly what I ordered, so I'm happy about that. Only thing is that the labels were all in Japanese, and they're in English on the images here, so that's a bit of false advertising, but other than that I'm happy. The actual plug for the wall also wasn't an American one, but good thing it came with an adapter😅",
        "rating": 4,
        "author": "Kevin",
        "date": ""
      },
      {
        "text": "how it came in abox that was deteriorating.looking used inside. im supposed to be getting a refund but will not be told to get a replacement. which is highly annoying because this was supposed to be a new console. all i wanted to do was play. but im not even sure when i can do that because even sending back will take a couple of days or even a whole week, and until then, i won't get the refund. this is all so disappointing and sad.",
        "rating": 3,
        "author": "Ali",
        "date": ""
      },
      {
        "text": "Showing US version of the switch but really is a Japanese version works like US other than the plugin has to have an adapter which is annoying and bulky.",
        "rating": 3,
        "author": "Mary",
        "date": ""
      },
      {
        "text": "This is a review of Arc Bargains, the seller, not of the actual product. Arc Bargains is not a real company. They do not actually sell things, they just take your money and hope you forget about your order. \nUnfortunately, I did not forget about my order. After waiting almost 4 weeks and still not having a tracking number, I reached out.\nThey did refund me quickly, stating a \"price glitch\" but based on other reviews I assume there was no glitch, they just don't actually have the product.",
        "rating": 1,
        "author": "ciara",
        "date": ""
      },
      {
        "text": "I ordered a Nintendo switch from Walmart online, and everything was good up till it was delivered. When I unboxed it I found that Walmart had sent me a Japanese Nintendo switch, nowhere online did it say the model I was purchasing was a Japanese version. Now I have to have my wife who I bought it for and is in another state trying to and exchange it at the Walmart by our house. By false advertising Walmart has just caused a major headache for us especially if they don't allow an in store  exchange because it was bought online. I'm never using Walmarts online website for big purchases again after this. I might have to pay a little extra at Best Buy or Target but at least I won't have to worry about false advertising.",
        "rating": 1,
        "author": "JD",
        "date": ""
      },
      {
        "text": "\"The listing was NOT clear that it was a foreign switch. The one that arrived was in Chinese. I spoke with Nintendo of America and they stated they wouldn't honor the warranty of a \"\"foreign-bought\"\" system in America. This was incredibly disheartening that the listing didn't state it was NOT an American system. The pictures and listing were misleading as they were in English.\"",
        "rating": 1,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "Don't know about the product quality, just know that everything was in Japanese or Chinese.  May or may not have been difficult to set up for a new user. The real issue was the charging cable not the standard American 120v type A or B plug. \n\nTook it to the local Wal Mart for an exchange, but since it was 3rd party they would only give a refund. All is good, just went to the back and bought the one from the store.",
        "rating": 1,
        "author": "Stephan",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2021 Apple 10.2-inch iPad Wi-Fi 64GB - Space Gray (9th Generation)",
    "rating": "Not found",
    "review_count": "17.3K ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/8e5d6663-e373-4629-b803-e6fa6151bcfc.bc4f3d047381f57c84a87b83a177a599.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/63511221-7c5f-4524-9f7a-26d21683c824.6d64a6447dcb1e2adaf66b9ca0e72299.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/66a814c0-26db-411d-8f44-c972029015a8.1dcdfe75990a3a3d910293e43cd6269f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f5cfd46b-23b1-40cc-b07d-f570fb0cadea.246faa9dad284e77804acd019e5338a8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $224.00",
    "description_1_text": " Delightfully capable. Surprisingly affordable.   iPad. More function. More fun.  Powerful. Easy to use. Versatile. iPad has a beautiful 10.2-inch Retina display,1 powerful A13 Bionic chip, and an Ultra Wide front camera with Center Stage. Work, play, create, learn, stay connected, and more. All at an incredible value. ",
    "description_2_text": " 10.2-inch Retina display1 with True Tone  A13 Bionic chip with Neural Engine 8MP Wide back camera  12MP Ultra Wide front camera with Center Stage Touch ID for secure authentication and Apple Pay Lightning connector for charging and accessories  Go far with all-day battery life2 Up to 256GB of storage3 iPadOS 16 makes your iPad even more capable with powerful new productivity and collaboration features Works with Apple Pencil (1st generation) and Smart Keyboard    Stay connected with 802.11ac Wi-Fi Legal: Accessories sold separately and subject to availability. Compatibility varies by generation. Apps are available on the App Store. Title availability is subject to change. Third-party software sold separately.    1. Display size is measured diagonally.    2. Battery life varies by use and configuration. See apple.com/batteries for more information.    3. Available space is less and varies due to many factors. Storage capacity subject to change based on software version, settings, and iPad model. 1GB = 1 billion bytes; 1TB = 1 trillion bytes. Actual formatted capacity less.    ",
    "reviews": [
      {
        "text": "this was my first time ordering from walmart i was a lil skeptical because of the other reviews but i need it for college i got it the same day and it’s perfect i’ve now had it for 2 days and it’s perfect !!!! not laggy !! it’s good with roblox as well lol it’s perfect !",
        "rating": 5,
        "author": "Cyla",
        "date": ""
      },
      {
        "text": "In reading all the reviews I was a bit reluctant , wondered even if I might get a box of crackers inside my iPad box or something . I ordered this with my grocery delivery from my local Walmart and it came brand new in its packaging . I’ve had it for about a month now and it’s working perfectly fine !",
        "rating": 5,
        "author": "Eliana",
        "date": ""
      },
      {
        "text": "2021 iPad is awesome and it came earlier than originally that it said it would be. I love it! I’d ordered one older and it didn’t compare to this Apple that I’d purchased. I would happily and DEFINITELY recommend it. Once again thank you  Apple! I also ordered a case to go with it.",
        "rating": 5,
        "author": "Shane",
        "date": ""
      },
      {
        "text": "This is a great iPad. This is the first iPad I've ever purchased and I'm glad I went with this one. It's great for watching YouTube and stuff. Also great for reading books! It also has surprisingly good camera quality. The only con I have noticed so far is it can get a little laggy while playing big games like Hello Kitty Adventure Island and Call of Duty Warzone. It isn't like unplayable laggy, but it can be annoying. Overall I would say for the great price it is worth it!",
        "rating": 5,
        "author": "Angelina",
        "date": ""
      },
      {
        "text": "Purchased this as a Christmas Gift for my cousin. It was not only a welcomed surprise, it was needed to help us stay connected via FaceTime hep her manage her time and bills as she downloaded an interactive personal day planner, she can check her emails, and I think why she loves it the most get recipes to cook and try new dishes for her boys!!",
        "rating": 5,
        "author": "Musiclover",
        "date": ""
      },
      {
        "text": "I love it! I use it a lot for school work and everything was very easy to transfer over from my old one! I never had a problem with this one and it holds battery well just be careful when u close ur case it might not shut off and will die faster.",
        "rating": 5,
        "author": "Dereka",
        "date": ""
      },
      {
        "text": "Despite the reviews i was very very sketched at first it was delayed for shipping and i canceled it and decided to pick it up. GO GET IT FROM THE STORE least chance if any complications or scams",
        "rating": 5,
        "author": "Nia",
        "date": ""
      },
      {
        "text": "I went back and forth on buying an iPad and which model. I read reviews and gen 9 was highly rated and I must say so far it has not let me down! I’m in love with this devices and it does everything I need it to, so let’s hope I still feel this way months down the line!",
        "rating": 4,
        "author": "Gina",
        "date": ""
      },
      {
        "text": "Ordered this new iPad online. Box was empty when I got it. Walmart won’t refund me or send a new one after multiple attempts to get one. Now I’m out $271.10. DO NOT ORDER THIS ITEM ONLINE.",
        "rating": 1,
        "author": "Lisa",
        "date": ""
      },
      {
        "text": "My address is 2919 cross st Trlr B, and the ipad was delivered to 2919 cross st A. I asked the neighbor and they said they did not receive anything. So either they’re lying or something stole it.",
        "rating": 1,
        "author": "Eli",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2020 Apple 10.9-inch iPad Air Wi-Fi + Cellular 64GB - Space Gray (4th Generation)",
    "rating": "(4.8)",
    "review_count": "981 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2020-Apple-10-9-inch-iPad-Air-Wi-Fi-Cellular-64GB-Space-Gray-4th-Generation_1d20de71-9151-425f-890b-2fd4c703c430.dfbaf58eff390bef1eec9774e2e32233.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/b66d522b-17de-47eb-bbed-af2a550ad976.cf9dab1ec8f62edfabe2bdd322ace49b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/ee4d4d2b-3f5a-42e2-9f22-4a23df300435.10f669e5311c1d6c9cea1a38bb5c7a56.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/a75b07fe-b225-48c1-bd81-468fb5cf4923.e70ba6937ff2509799058c83a79e6d0d.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/c5ed0c45-313b-49d6-a820-0ee6172c846d.b34cf9bc61cff8ff45672cc2a40670b5.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/a37e4492-9a33-4c1d-8f9c-3cc4dd27c58a.9d181df561eeda5af8b0424fda6f37e0.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $656.00",
    "description_1_text": "iPad Air. With a stunning 10.9-inch Liquid Retina display and True Tone for a more comfortable viewing experience.1 Powered by the new A14 Bionic chip with Neural Engine for 4K video editing, music creation, and next-level games \u0080\u0094all with ease. Featuring fast, easy, and secure Touch ID, advanced cameras, USB-C, and support for versatile accessories, including Magic Keyboard and Apple Pencil (2nd generation).",
    "description_2_text": "2020 Apple iPad Air 10.9-inch (4th Generation)  Stunning 10.9-inch Liquid Retina display with True Tone and P3 wide color A14 Bionic chip with Neural Engine Touch ID for secure authentication and Apple Pay 12MP back camera, 7MP FaceTime HD front camera Available in Silver, Space Gray, Rose Gold, Green, and Sky Blue Wide stereo audio Wi-Fi 6 (802.11ax) and Gigabit-class LTE cellular data Up to 10 hours of battery life USB-C connector for charging and accessories Support for Magic Keyboard, Smart Keyboard Folio, and Apple Pencil (2nd generation) iPadOS 14 brings new capabilities designed specifically for iPad  Legal  Apps are available on the App Store. Title availability is subject to change. The display has rounded corners. When measured diagonally as a rectangle, the iPad Air (4th generation) screen is 10.86 inches. Actual viewable area is less. Accessories are sold separately. Compatibility varies by generation. Battery life varies by use and configuration. See apple.com/batteries for more information. Data plan required. Gigabit-class LTE, LTE Advanced, LTE, and Wi-Fi calling are available in select markets and through select carriers. Speeds are based on theoretical throughput and vary based on site conditions and carrier. For details on LTE support, contact your carrier and see apple.com/ipad/LTE. ",
    "reviews": [
      {
        "text": "Excellent quality, the processing speed, aesthetics, camera , the design , security features on Apple , Touch ID enabled, simply has everything you'd need in an iPad .",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "Super fast and convenient. Not that big. I love it",
        "rating": 5,
        "author": "Amarien",
        "date": ""
      },
      {
        "text": "I had the 1st generation iPad Air and I loved it and I decided to get the newer edition after seeing the reviews. The speed is so much better and the screen quality is superb. I bought the Magic Keyboard and Apple Pencil 2 to go with it and it is great. I will be using this for college.",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "A great device! Is super fast and I just love it.",
        "rating": 5,
        "author": "David G",
        "date": ""
      },
      {
        "text": "Light weight, user friendly, good for everyday use for home or business. Battery life is amazing",
        "rating": 5,
        "author": "StacyTrenee",
        "date": ""
      },
      {
        "text": "I have had all iPad Air generations, and this so far is the best. If you don't want to spend on the pro but want more than the basic this is the way to go. You get the best of both worlds. Love and would recommend",
        "rating": 5,
        "author": "Cesar HTX",
        "date": ""
      },
      {
        "text": "Love love love my new iPad",
        "rating": 5,
        "author": "J Bailey",
        "date": ""
      },
      {
        "text": "Absolutely love it, would buy again",
        "rating": 5,
        "author": "Aisha Yvonne",
        "date": ""
      },
      {
        "text": "Tablet keeps turning off at the Apple store now hopefully they can fix the issue as it's only 3weeks old.",
        "rating": 3,
        "author": "KekeL",
        "date": ""
      },
      {
        "text": "My daughter hates no IPad Air doesn't offer Memoji. Didn't realize we needed the iPad Pro for those features.",
        "rating": 3,
        "author": null,
        "date": ""
      }
    ]
  },
  {
    "product_name": "2022 Apple 10.9-inch iPad Air Wi-Fi 256GB - Blue (5th Generation)",
    "rating": "(4.7)",
    "review_count": "1,188 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2022-Apple-10-9-inch-iPad-Air-Wi-Fi-256GB-Blue-5th-Generation_5359da95-c591-4175-8c9c-f270964ba5ec.7dd7fa7870d360f51aca6c619b8d6a10.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/46879f88-74f1-4449-9dc9-5e5961864294.1a0a4ab108fe9f0f0fd5e69152d638bf.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/52c3b198-7899-42ec-b450-8dd3be822558.dccaa3f7f0b3e6d163461c05ee298db6.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/3aa61150-5466-44b5-b1e2-3363bf765da2.8f8b1f75ff01ca59642aba0788836f20.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/9110584c-f2e7-4229-8819-9d6924c78961.4234ca93f2bbc1e423c5bdf2e16dac07.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/7ef1720d-f35b-4b49-9b56-1f6c507ba4b1.38eab7a4276f95f9c6bd4bbd8b1775f1.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$699.00",
    "description_1_text": "Light. Bright. Full of might.  Supercharged by M1. iPad Air. With an immersive 10.9-inch Liquid Retina display. The breakthrough Apple M1 chip delivers faster performance, making iPad Air a creative and mobile gaming powerhouse. Featuring Touch ID, advanced cameras, blazing-fast 5G2 and Wi-Fi 6, USB-C, and support for Magic Keyboard and Apple Pencil (2nd generation). ",
    "description_2_text": " Key Features:         10.9-inch Liquid Retina display with True Tone, P3 wide color, and an antireflective coating Apple M1 chip with Neural Engine 12MP Wide camera  12MP Ultra Wide front camera with Center Stage Up to 256GB of storage Available in blue, purple, pink, starlight, and space gray Stereo landscape speakers Touch ID for secure authentication and Apple Pay All-day battery life Wi-Fi 6 USB-C connector for charging and accessories Works with Magic Keyboard, Smart Keyboard Folio, and Apple Pencil (2nd generation) iPadOS 15 is uniquely powerful, easy to use, and designed for the versatility of iPad    Legal:     Apps are available on the App Store. Title availability is subject to change.  The display has rounded corners. When measured diagonally as a rectangle, the iPad Air screen is 10.86 inches. Actual viewable area is less.  Data plan required. 5G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on 5G support, contact your carrier and see apple.com/ipad/cellular.  Accessories are sold separately. Compatibility varies by generation.  Battery life varies by use and configuration. See apple.com/batteries for more information.  ",
    "reviews": [
      {
        "text": "I was able to transfer all of my data from my 10 year old iPad Air. I had to work up the courage to do it. I'm 81 but I did it and I'm satisfied. I look forward to learning all the things this new one can do. It is beautiful in every way. I got the 256 MB because I have so many pictures and I may download some other things.",
        "rating": 5,
        "author": "bird teacher",
        "date": ""
      },
      {
        "text": "I got my iPad in June but I have used until now and it's great! I was scared buying it from Walmart online but it was fast getting here and I haven't had any problems since. If you're questioning on getting it then just get it! Plus it cheaper than other online stores. (The case is from Amazon and I was blocking my pictures that are widgets)",
        "rating": 5,
        "author": "Chisom",
        "date": ""
      },
      {
        "text": "Walmart has the best price for this ipad air 5th generation. Needed, well, wanted to upgrade old ipad 6th generation. After much research determined this air was a much better value for features than 9th or 10th generation.  Love the blue color. \nHighly recommend, speedy shipping as promised. Arrived safely with no problems.",
        "rating": 5,
        "author": "puzzlegirl",
        "date": ""
      },
      {
        "text": "I love it! Great price too. It did take a while to get it set up. I don't know if it was because I had never had an Apple before or not.  The 2 ladies who set it up for me had Apple cell phones and tablets. But now that it is up and working I like it very much.",
        "rating": 5,
        "author": "Rebecca",
        "date": ""
      },
      {
        "text": "iPad tablets have been getting more and more expensive. This M1 is priced reasonably and will be more than enough for 90% of folks out there. Got two of these as a gift for my parents - so they can sit back, relax and enjoy content consumption. They absolutely love it!",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "iPad tablets have been getting more and more expensive. This M1 is priced reasonably and will be more than enough for 90% of folks out there. Got two of these as a gift for my parents - so they can sit back, relax and enjoy content consumption. They absolutely love it!",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "Beast of a tablet for $**** (got it on sale), able to multitask apps like Word and multiple browser pages as well as a YouTube video with no lag or stuttering anywhere, just shows you what Apple's M1 chip can do in IOS devices, it doesn't even get hot after hours with the screen on. Even better when paired with an Apple Pencil gen 2. Battery life is acceptable, takes a while to charge with the stock charger though. Definitely would recommend if you can find it on sale.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "I needed a new iPad due to having the 2013(I think, it was the air 2) and I wanted to be able to carry to work, meetings, PDs, etc. I have a huge OMEN laptop and that thang is HEAVY!!!!!! So here comes the iPad to the rescue. It is relatively fast, battery life is the bomb, it has clear graphics, and feels in between(not heavy, but not light). I bought the pencil 2 and the Magic Keyboard in white to match! I am very happy with this purchase overall and yes I would buy again and recommend to others.  Walmart online is the place to shop because the prices are cheaper!!!!!!! I compared Walmart with best buy. Best buy was going to charge $1087 for everything while I got all three for $866 to be exact!!! If you are shopper, especially for Walmart, do it online! That is the hidden gem!!!",
        "rating": 5,
        "author": "KayBee",
        "date": ""
      },
      {
        "text": "Got this for College. I am SOO excited to use this to play games and draw when I have free time. Definitely a better option for writing notes. Soo glad I saved $200!!! It makes me feel so much better knowing all the paper I will be saving using this and knowing I will have access to my notes on any apple device to re read and quiz myself. Excited to start the new semester with this device!!",
        "rating": 5,
        "author": "Mandy",
        "date": ""
      },
      {
        "text": "I ordered this iPad Air and unfortunately it would not even turn on, tried charging it overnight and it still would not come on. I was able to return it to a walmart store with an easy app return process for a full refund. I always have enjoyed apple products and the easy return process so I'll give it three stars, but my specific iPad I got was defective.",
        "rating": 3,
        "author": "Joe",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2022 Apple 10.9-inch iPad Air Wi-Fi 256GB - Blue (5th Generation)",
    "rating": "(4.7)",
    "review_count": "1,188 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2022-Apple-10-9-inch-iPad-Air-Wi-Fi-256GB-Blue-5th-Generation_5359da95-c591-4175-8c9c-f270964ba5ec.7dd7fa7870d360f51aca6c619b8d6a10.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/46879f88-74f1-4449-9dc9-5e5961864294.1a0a4ab108fe9f0f0fd5e69152d638bf.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/52c3b198-7899-42ec-b450-8dd3be822558.dccaa3f7f0b3e6d163461c05ee298db6.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/3aa61150-5466-44b5-b1e2-3363bf765da2.8f8b1f75ff01ca59642aba0788836f20.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/9110584c-f2e7-4229-8819-9d6924c78961.4234ca93f2bbc1e423c5bdf2e16dac07.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/7ef1720d-f35b-4b49-9b56-1f6c507ba4b1.38eab7a4276f95f9c6bd4bbd8b1775f1.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$699.00",
    "description_1_text": "Light. Bright. Full of might.  Supercharged by M1. iPad Air. With an immersive 10.9-inch Liquid Retina display. The breakthrough Apple M1 chip delivers faster performance, making iPad Air a creative and mobile gaming powerhouse. Featuring Touch ID, advanced cameras, blazing-fast 5G2 and Wi-Fi 6, USB-C, and support for Magic Keyboard and Apple Pencil (2nd generation). ",
    "description_2_text": " Key Features:         10.9-inch Liquid Retina display with True Tone, P3 wide color, and an antireflective coating Apple M1 chip with Neural Engine 12MP Wide camera  12MP Ultra Wide front camera with Center Stage Up to 256GB of storage Available in blue, purple, pink, starlight, and space gray Stereo landscape speakers Touch ID for secure authentication and Apple Pay All-day battery life Wi-Fi 6 USB-C connector for charging and accessories Works with Magic Keyboard, Smart Keyboard Folio, and Apple Pencil (2nd generation) iPadOS 15 is uniquely powerful, easy to use, and designed for the versatility of iPad    Legal:     Apps are available on the App Store. Title availability is subject to change.  The display has rounded corners. When measured diagonally as a rectangle, the iPad Air screen is 10.86 inches. Actual viewable area is less.  Data plan required. 5G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on 5G support, contact your carrier and see apple.com/ipad/cellular.  Accessories are sold separately. Compatibility varies by generation.  Battery life varies by use and configuration. See apple.com/batteries for more information.  ",
    "reviews": [
      {
        "text": "I was able to transfer all of my data from my 10 year old iPad Air. I had to work up the courage to do it. I'm 81 but I did it and I'm satisfied. I look forward to learning all the things this new one can do. It is beautiful in every way. I got the 256 MB because I have so many pictures and I may download some other things.",
        "rating": 5,
        "author": "bird teacher",
        "date": ""
      },
      {
        "text": "I got my iPad in June but I have used until now and it's great! I was scared buying it from Walmart online but it was fast getting here and I haven't had any problems since. If you're questioning on getting it then just get it! Plus it cheaper than other online stores. (The case is from Amazon and I was blocking my pictures that are widgets)",
        "rating": 5,
        "author": "Chisom",
        "date": ""
      },
      {
        "text": "Walmart has the best price for this ipad air 5th generation. Needed, well, wanted to upgrade old ipad 6th generation. After much research determined this air was a much better value for features than 9th or 10th generation.  Love the blue color. \nHighly recommend, speedy shipping as promised. Arrived safely with no problems.",
        "rating": 5,
        "author": "puzzlegirl",
        "date": ""
      },
      {
        "text": "I love it! Great price too. It did take a while to get it set up. I don't know if it was because I had never had an Apple before or not.  The 2 ladies who set it up for me had Apple cell phones and tablets. But now that it is up and working I like it very much.",
        "rating": 5,
        "author": "Rebecca",
        "date": ""
      },
      {
        "text": "iPad tablets have been getting more and more expensive. This M1 is priced reasonably and will be more than enough for 90% of folks out there. Got two of these as a gift for my parents - so they can sit back, relax and enjoy content consumption. They absolutely love it!",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "iPad tablets have been getting more and more expensive. This M1 is priced reasonably and will be more than enough for 90% of folks out there. Got two of these as a gift for my parents - so they can sit back, relax and enjoy content consumption. They absolutely love it!",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "Beast of a tablet for $**** (got it on sale), able to multitask apps like Word and multiple browser pages as well as a YouTube video with no lag or stuttering anywhere, just shows you what Apple's M1 chip can do in IOS devices, it doesn't even get hot after hours with the screen on. Even better when paired with an Apple Pencil gen 2. Battery life is acceptable, takes a while to charge with the stock charger though. Definitely would recommend if you can find it on sale.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "I needed a new iPad due to having the 2013(I think, it was the air 2) and I wanted to be able to carry to work, meetings, PDs, etc. I have a huge OMEN laptop and that thang is HEAVY!!!!!! So here comes the iPad to the rescue. It is relatively fast, battery life is the bomb, it has clear graphics, and feels in between(not heavy, but not light). I bought the pencil 2 and the Magic Keyboard in white to match! I am very happy with this purchase overall and yes I would buy again and recommend to others.  Walmart online is the place to shop because the prices are cheaper!!!!!!! I compared Walmart with best buy. Best buy was going to charge $1087 for everything while I got all three for $866 to be exact!!! If you are shopper, especially for Walmart, do it online! That is the hidden gem!!!",
        "rating": 5,
        "author": "KayBee",
        "date": ""
      },
      {
        "text": "Got this for College. I am SOO excited to use this to play games and draw when I have free time. Definitely a better option for writing notes. Soo glad I saved $200!!! It makes me feel so much better knowing all the paper I will be saving using this and knowing I will have access to my notes on any apple device to re read and quiz myself. Excited to start the new semester with this device!!",
        "rating": 5,
        "author": "Mandy",
        "date": ""
      },
      {
        "text": "I ordered this iPad Air and unfortunately it would not even turn on, tried charging it overnight and it still would not come on. I was able to return it to a walmart store with an easy app return process for a full refund. I always have enjoyed apple products and the easy return process so I'll give it three stars, but my specific iPad I got was defective.",
        "rating": 3,
        "author": "Joe",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2024 Apple 11-inch iPad Air M2, Built for Apple Intelligence, Wi-Fi 128GB - Space Gray",
    "rating": "Not found",
    "review_count": "135 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2024-Apple-11-inch-iPad-Air-M2-Wi-Fi-128GB-Space-Gray_18c7905d-ad45-4d07-8558-c76c38388fbe.aa52f7bf9c4f09253a12f9b6878f5378.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/2024-Apple-11-inch-iPad-Air-M2-Wi-Fi-128GB-Space-Gray_18c7905d-ad45-4d07-8558-c76c38388fbe.aa52f7bf9c4f09253a12f9b6878f5378.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/863e2421-d403-4c0b-bfdc-9d9dfc865a31.222a96784d2ababa2dd724213cd88ab5.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/0bb6519e-58de-467c-bbb6-183c1377afa8.1e462a14cdd6d2cbd0c097d54540b767.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/a94bba6b-e3ef-4b46-a9f8-65a3fb7379bb.c380d5c44ed2d23297636cc4fb8a8c03.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/41272ea2-023c-419f-bc99-2d4ab3dffbd0.89a19080ef1991232162cb49597d4e0f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$564.00",
    "description_1_text": " iPad Air. Fresh Air.   iPad Air. Light. Speed.   iPad Air. Dream big.   The redesigned 11-inch iPad Air is supercharged by the incredibly fast Apple M2 chip.1 It features a stunning Liquid Retina display, a new landscape camera perfect for FaceTime and video calls, and superfast Wi-Fi 6E.2 And it works with the new Apple Pencil Pro and Magic Keyboard, so you can multitask, study, work, play, and create from anywhere..",
    "description_2_text": " 11-INCH LIQUID RETINA DISPLAY—The gorgeous Liquid Retina display features advanced technologies like P3 wide color, True Tone, and ultralow reflectivity, which make everything look stunning. BUILT FOR APPLE INTELLIGENCE: Apple Intelligence helps you write, express yourself, and get things done effortlessly. It draws on your personal context while setting a brand-new standard for privacy in AI. Coming in beta this fall. PERFORMANCE AND STORAGE—The M2 chip lets you multitask smoothly between powerful apps and play graphics-intensive games. And with all-day battery life, you can keep working and playing wherever you go.4 Choose up to 1TB of storage depending on the room you need for apps, music, movies, and more. IPADOS + APPS—iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. Stage Manager makes multitasking easy with resizable, overlapping apps and external display support. iPad Air comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store. APPLE PENCIL AND MAGIC KEYBOARD—Apple Pencil Pro transforms iPad Air into an immersive drawing canvas and the world’s best note‑taking device. Apple Pencil (USB-C) is also compatible with iPad Air. Magic Keyboard features a great typing experience and a built‑in trackpad, while doubling as a protective cover for iPad. Accessories sold separately. ADVANCED CAMERAS—iPad Air features a landscape 12MP Ultra Wide front camera that supports Center Stage for videoconferencing or epic Portrait mode selfies. The 12MP Wide back camera with True Tone flash is perfect for capturing photos and 4K videos. And get great sound with dual studio-quality mics and landscape stereo speakers UNLOCK AND PAY WITH TOUCH ID—Touch ID is built into the top button, so you can use your fingerprint to unlock your iPad Air, sign in to apps, and make payments securely with Apple Pay.     Legal    Accessories sold separately and subject to availability. Compatibility varies by generation. Apps are available on the App Store. Title availability is subject to change. Third-party software sold separately.   1. The display has rounded corners. When measured diagonally as a rectangle, the 11-inch iPad Air 10.86 inches. Actual viewable area is less.    2. Wi-Fi 6E available in counties and regions where supported.   3. Battery life varies by use and configuration. See apple.com/batteries for more information.    4. Available space is less and varies due to many factors. Storage capacity subject to change based on software version, settings, and iPad model. 1GB = 1 billion bytes; 1TB = 1 trillion bytes. Actual formatted capacity less.   5. Apple Intelligence will be available in beta on iPad with M1 and later, with Siri and device language set to U.S. English, as part of iPadOS 18 this fall. ",
    "reviews": [
      {
        "text": "I use this device on a regular daily basis and it is worth the investment. The ease f transferring data from old device to the new was bar none. The apps and software are the best on the market not to mention the portability benefits.",
        "rating": 5,
        "author": "GratefulCustomer",
        "date": ""
      },
      {
        "text": "The case fits my iPad Air perfectly.  Color is nice, and I like the soft feel.  I wish it came without the Apple Pencil holder.  I don't have a pencil and don't intend to get one, so the pencil holder just makes the case a little wider than I need.",
        "rating": 5,
        "author": "Nanaof2",
        "date": ""
      },
      {
        "text": "Great for back to school I'm super exited to be using this all year. Get the 11in it's definitely worth it and the size is still big",
        "rating": 5,
        "author": "Richy",
        "date": ""
      },
      {
        "text": "It super nice to hold in hands. Getting used to it still but very excited to see what it can do. Got it for school work like notes.",
        "rating": 5,
        "author": "Alex",
        "date": ""
      },
      {
        "text": "I purchased this Ipad for nursing school. I love everything about it so far.",
        "rating": 5,
        "author": "Jennifer",
        "date": ""
      },
      {
        "text": "The Apple products are excellent and very functional. Easy  to manuver.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "Got it for my daughter for college. So far so good! No complaints, thus far! :)",
        "rating": 4,
        "author": "Nosnibor06",
        "date": ""
      },
      {
        "text": "I like the size of the screen. It was a good size to see everything, especially if you have vision problems. Don't like how difficult it was for a first time buyer to set up and sync with my iPhone and games I play.",
        "rating": 3,
        "author": "SondaDeeIsMe",
        "date": ""
      },
      {
        "text": "Did anyone else miss out on an apple sticker or just me?? Or do the new iPads don't come with one. Also my iPad is dying super fast",
        "rating": 3,
        "author": "Courtney",
        "date": ""
      },
      {
        "text": "DO NOT! I repeat, DO NOT do business with this seller. You will regret it. You were warned!!!\n\nMy experience: Never recieved my package. Was told I signed for it when I did not. Tried to get FedEx to help and sure enough that did squat cause the seller needed to contact them and they would not even tho they said they would. Just so unprofessional!!!!",
        "rating": 1,
        "author": "Lee",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Pre-Owned Apple MacBook Pro Laptop, 13.3\", Intel Core i7, 16GB RAM, 256GB SSD, Mac OSx Catalina, Gray, MPXV2LL/A BTO",
    "rating": "(3.5)",
    "review_count": "139 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Apple-MacBook-Pro-Laptop-13-3-Intel-Core-i7-16GB-RAM-256GB-SSD-Mac-OSx-Catalina-Gray-MPXV2LL-A-BTO-Pre-Owned-Like-New_eff9a293-dcac-4652-bf50-89c891e7f636.f3772c25589902d95a252acbaa60520e.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$471.84",
    "description_1_text": "This MacBook Pro is powered by a 3.5 GHz Intel \"Core i7\" processor, with four independent processor \"cores\" on a single silicon chip, This notebook also packs 16 GB of onboard 2133 MHz LPDDR3 SDRAM 512 GB flash storage. It has integrated Intel Iris Plus Graphics 650 graphics processor that shares memory with the system. Notebook has an integrated 720p FaceTime HD webcam, a thin, backlit keyboard with an integrated \"Touch Bar\" with a touch-sensitive control. It has a high-resolution LED-backlit 13.3\" widescreen 2560 x 1600 \"Retina\" display.",
    "description_2_text": " 16 GB main memory, Intel 256 GB SSD flash storage drive The battery provides an estimated 10 hours of runtime This model was introduced in June 2017 and discontinued in July 2018 ",
    "reviews": [
      {
        "text": "They had a good price on the 2022 version. I've had Mac book before and tried HP %26 ASUS. Both nowhere near the quality of the Mac. Love the slim size.  Surround speakers have lots of volume and very clear. Best camera I've seen on any computer.  Long battery life.  Reasonably fast processor. Just all around  great quality  laptop.",
        "rating": 5,
        "author": "Clifford",
        "date": ""
      },
      {
        "text": "Shipping was terrible. The computer came in a big Fed-Ex box and inside there was nothing but small bubble wrap around computer. There was no packing or anything. Computer has cosmetic damage (knicks, scratches) all over. Luckily everything works and the screen is fine. Better packaging is needed, it is not a t-shirt its a computer.",
        "rating": 3,
        "author": "Jacob",
        "date": ""
      },
      {
        "text": "it shuts off often, randomly. it was working well for the first week and now it's like junk. i did buy it used, so maybe it's not the mac itself, just the fact that it's used.",
        "rating": 2,
        "author": "jenna",
        "date": ""
      },
      {
        "text": "The laptop arrived sticky with some type of white substance on keys and the screen.After wiping the computer off it did look nice no real noticeable damage but The battery only lasted an hour.",
        "rating": 2,
        "author": "Deshawn",
        "date": ""
      },
      {
        "text": "This computer was originally from 2017 (not notated in the description) and it cannot do any updates, therefore you cannot load any software on it and it is not able to be used at all even with the simplest apps %26 software.  I will be returning it and getting my money back.",
        "rating": 1,
        "author": "UpsetCustomer",
        "date": ""
      },
      {
        "text": "I bought it and payed 480 almost it came dented and the adapter for the charger came bent so I wasn't able to plug the charger in and I used a different adapter and it never turned on I left for 20 minutes and it never turned on I'm not spending 480 for something that does not work. Also it's all scratched up and did not show any of that in the pictures",
        "rating": 1,
        "author": "Alexander",
        "date": ""
      },
      {
        "text": "So far it only turned on once then just turned off and is now not turning on I now have to wait 48 hours for a response and I have to go out of my way to return it",
        "rating": 1,
        "author": "Riley",
        "date": ""
      },
      {
        "text": "I bought a laptop on November, they soon sent me one that it was a wrong model so I returned it and they never answered back, I'm still waiting for my refund or my laptop. Walmart is looking the other way, they won't do anything to help. My lawyer is on it but in the meantime, DO NOT BUY FROM THEM.",
        "rating": 1,
        "author": "G",
        "date": ""
      },
      {
        "text": "First off, what I received could've cost me around $200 less, but without the bad experience these scams put you through.\n1.- The battery is trash, it was complaining for service already, and of course, the charge barely last 2 hours from 99% to 18%.\n2.- The power charger is junk too, I mean, even though it looks like a cheap cloned stuff, it's not even charging at all, I had to connect an original one I had to power up the machine. This is cheap.\n3.- They sell this product as Core i7, 3.5 GHz processor, SSD, MacOS Catalina. I received a Core i5, 3.1 GHz, Flash Storage, MacOS High Sierra. \nI mean, overall, I can see based on similar comments how these \"sellers\" can cheat using Walmart to take you for a ride. Stay away.\nReally disappointed.",
        "rating": 1,
        "author": "Victor",
        "date": ""
      },
      {
        "text": "This came with food all over it, the keys are sticky with I don't know what and it has dents and scratches all over it!!",
        "rating": 1,
        "author": "Ashley",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Restored Apple MacBook Pro Core i7 Retina 2.7GHz 16GB RAM 512GB SSD Touch 15\" - MLH42LL/A (Refurbished)",
    "rating": "(3.1)",
    "review_count": "86 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Restored-Apple-MacBook-Pro-Core-i7-Retina-2-7GHz-16GB-RAM-512GB-SSD-Touch-15-MLH42LL-A-Refurbished_75d6add2-a0f1-4eff-ab15-ad4ad4e7f64f.f852d2e11eb344d7ccb6461abb1408f9.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/c2621e21-bc46-47f8-afa1-2f83f49a5a08.020ed9991a8999133e635963a43363f6.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$417.00",
    "description_1_text": "Refurbished Apple MacBook Pro Core i7 Retina 2.7GHz 16GB RAM 512GB SSD Touch 15\" - MLH42LL/A.",
    "description_2_text": " This MacBook Pro has been professionally restored to working order by an approved vendor. Power adapter is included.  Original packaging is not included. ",
    "reviews": [
      {
        "text": "I have already recommended this to several friends! It's beautiful, looks brand new, works like a dream and I used it last night for several hours before having to recharge the battery. I am very pleased with this laptop. I bought a similar one for my daughter in 2018 for almost $2000. This was a fabulous purchase. Thank you, Walmart!",
        "rating": 5,
        "author": null,
        "date": ""
      },
      {
        "text": "I go to the upgraded model with the same price. This is awesome and I love the laptop very much. It goes fast and easy to use.",
        "rating": 5,
        "author": "Danny",
        "date": ""
      },
      {
        "text": "It's a fine product. it has a scratches on the outside but nothing to crazy, the only thing “wrong” with it is the battery life but if you need somthing cheap and good this computer is the best bang for your buck.",
        "rating": 4,
        "author": "jacques",
        "date": ""
      },
      {
        "text": "poor packaging. the battery life recommends servicing. it has a tiny dent on the back that causes a tiny mark on the screen only visible when the screen is displaying something dark.",
        "rating": 3,
        "author": "Janell",
        "date": ""
      },
      {
        "text": "Product is fine. Battery lasts less than an hour. Battery should have been replaced/refurbished with the rest of the product.",
        "rating": 2,
        "author": "James",
        "date": ""
      },
      {
        "text": "My refurbished MacBook arrived in a FedEx box with no protective packaging. Some of the keys on the keyboard didn't work and bar tag didn't light up on the way. Called the selling company multiple times, no one ever answered the phone or replied to my texts. Walmart even said that they reached out and spoke with the company and someone would from the company would call me. They never called. The MacBook also looked so dirty that the customer service staff at Walmart said they sold it to you looking like this and I yes. I love spending my money at Walmart and I'm thankful that they even tried to get an exchange for me. Do not buy any MacBooks from to 2 day express. It was clear that they did not inspect the MacBook before shipping it to me😩😩😩",
        "rating": 1,
        "author": "Curtis",
        "date": ""
      },
      {
        "text": "Computer arrived inside a fedex box with a single sheet of bubble wrap around it. No fragile product sticker on the box which is why the screen was cracked when it arrived. Also, the sound was messed up. Had to return it.",
        "rating": 1,
        "author": "Tandaleyia",
        "date": ""
      },
      {
        "text": "Got the wrong product and wouldn't print. Sent it back the next day  and they stop responding to me and haven't gotten a refund",
        "rating": 1,
        "author": "annabelle",
        "date": ""
      },
      {
        "text": "Battery life is bad, keys are sticky and it arrived with almost sand like grits by the screen and keyboard. It is NOT like new, major signs of usage.",
        "rating": 1,
        "author": "Noah",
        "date": ""
      },
      {
        "text": "Keeps rebooting showing that it's locked out will not wake up from sleep mode, and I've had to take it to Apple to be looked over",
        "rating": 1,
        "author": "Thomas",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Restored Apple MacBook Air 13.3-inch Intel Core i5 8GB RAM Mac OS 128GB SSD Bundle: USA Essentials Bluetooth/Wireless Airbuds, Black Case, Wireless Mouse By Certified 2 Day Express (Refurbished)",
    "rating": "(3.6)",
    "review_count": "353 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Restored-Apple-MacBook-Air-13-3-inch-Intel-Core-i5-8GB-RAM-Mac-OS-128GB-SSD-Bundle-USA-Essentials-Bluetooth-Wireless-Airbuds-Black-Case-Wireless-Mous_a6330d48-b1aa-4ec2-991d-1258a004865e.bb4ec048393e8705ba0a206131b24f90.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/d69a487e-36b2-407e-bb57-4db156975e1a.0d95fd455ec3f04875c89a7af94b246b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/23aac572-ab2f-4be8-bc64-d92bf05f9557.c8f45139547876571dcdaf7171ea1fad.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/03bb70f9-1c2b-4cb2-88e2-0d2f3d38b239.19f7d78554f725f42d9cfeb60890d903.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/0e68b578-819f-47de-87b7-cd4d0be1b021.2126efc0d9c08c469bd92a5e38935344.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/3745d959-66cc-44c2-826c-5be35fd2c4f0.d32e25fcdf272c91bae8acda4d1aa5a9.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$199.00",
    "description_1_text": "This Apple MacBook Air has an 13.3-inch widescreen TFT LED backlit active-matrix \"glossy\" display with 1440 x 900 native resolution. Powered by Intel Core i5 and Intel HD Graphics. Solid State Drive (SSD) capacity of 128GB with 8GB of RAM. This device has been tested to be in great working condition. It will show signs of use and cosmetic blemishes which may included some scratched/dings, all of which do not affect the usability of this device.",
    "description_2_text": " Display      11.6-inch (diagonal) LED-backlit glossy widescreen display (1366 x 768 native resolution)   Processor      Dual-core Intel Core i5   Battery and Power      Up to 9 hours wireless web Up to 10 hours iTunes movie playback Up to 30 days standby time Built-in 38-watt-hour lithium-polymer battery   Size and Weight      Height: 0.11 - 0.68 in (0.3 - 1.7 cm) Width: 11.8 in (30 cm) Depth: 7.56 in (19.2 cm) Weight: 2.38 lbs (1.08 kg)   Graphics and Video Support      Intel HD Graphics Dual display and video mirroring Thunderbolt digital video output   Camera      720p FaceTime HD camera   Charging and Expansion      Two USB 3 ports (up to 5 Gbps) Thunderbolt 2 port (up to 20 Gbps) MagSafe 2 power port   Wireless      802.11ac Wi-Fi wireless networking; IEEE 802.11a/b/g/n compatible Bluetooth 4.0 wireless technology   Audio      Stereo speakers Dual microphones 3.5 mm headphone jack   Keyboard and Trackpad      Full-size backlit keyboard with 78 (U.S.) or 79 (ISO) keys, including 12 function keys and 4 arrow keys with ambient light sensor Multi-Touch trackpad for precise cursor control; supports inertial scrolling, pinch, rotate, swipe, three-finger swipe, four-finger swipe, tap, double-tap, and drag capabilities   ",
    "reviews": [
      {
        "text": "I am pleased with my purchase and for what I use it for, it's meeting my needs. I was skeptical about buying a refurbished model but I'm not disappointed.",
        "rating": 5,
        "author": "VetteMc",
        "date": ""
      },
      {
        "text": "I was skeptical at first but it's been so easy to use and nothing wrong with it . There is a little mark on the inside by the camera that you don't notice unless your supper close to it . I brought a covering and it worked beautifully to cover it up . The computer runs good and I love it so much !!",
        "rating": 5,
        "author": "adelaida",
        "date": ""
      },
      {
        "text": "This is my first Apple product and I like it. It came with a mouse and iPods. I've been using it sparingly but so far so good. Except the ear pods. I've been having a little problem getting them paired. Other than that, just by looking at the MacBook, an unexperienced user of Apple products wouldn't know it isn't brand new and has IOS Catalina (software from 2018) that needs to be upgraded as does the Safari browser. But I had no problem upgrading to IOS Monterey (version 12) which was required by my password manager. I like it! Also it came with a 2 piece case that is supposed to help air flow, to keep it from over heating.",
        "rating": 4,
        "author": "steven",
        "date": ""
      },
      {
        "text": "And this is set up of computer was difficult. It would not take my Apple ID. But when I skipped that part, it's set up fine. Earbuds are not compatible with the computer. They would not set up on it. Otherwise it works really well. And definitely worth the money.",
        "rating": 4,
        "author": "KiranZenukie",
        "date": ""
      },
      {
        "text": "I was really excited to get this bundle just for it to arrived broken and unusable. I thought it was just dead so I left the MacBook charging for a whole work shift just to come back home to a still completely dead device. MacBook seemed damaged as well.",
        "rating": 1,
        "author": "Miri",
        "date": ""
      },
      {
        "text": "There must have been an issue with the way the computer was restored because once I reached the page to log into the iTunes there was never a way to agree to the legal portion to move forward in the setup process.",
        "rating": 1,
        "author": "Glynis",
        "date": ""
      },
      {
        "text": "The battery was not quality seems to have not been replaced. The case had way more blemishes and dents and scratches than like new should have. Did not have charger that worked",
        "rating": 1,
        "author": "Abby",
        "date": ""
      },
      {
        "text": "The quality is blurry and weird looking. Like it was a android wrapped in a Apple case. The usb and ports aren’t working. And I can’t download or do anything with this version of the MacBook. I also thought it was a plus getting the case and headphones so I went with Walmart over Amazon but the headphones were the worst and didn’t work. The case kept popping off the labtop. It was a nice gesture though.",
        "rating": 1,
        "author": "Brittney",
        "date": ""
      },
      {
        "text": "I understand that the product is restored. It was advertised as restored like new I just recieved the product in the mail and unfortunately it only stays on if it's hooked up to the power cord. There is also long deep scratches in the screen I would not recommend this seller or product. It's was definitely false advertised and the things wrong with it should have been noted in the items description.",
        "rating": 1,
        "author": "Seasons",
        "date": ""
      },
      {
        "text": "When I bought this it appeared that it came with headphones and a wireless mouse but only the laptop arrived I made a complaint and they said to return the equipment, they are scammers",
        "rating": 1,
        "author": "NESTOR",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Restored Apple MacBook Air 13.3\" (2020) MWTJ2LL/A Intel Core i3 - 8GB Memory, 256GB SSD - Space Gray (Refurbished)",
    "rating": "Not found",
    "review_count": "121 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Restored-Apple-MacBook-Air-13-3-2020-MWTJ2LL-A-Intel-Core-i3-8GB-Memory-256GB-SSD-Space-Gray-Refurbished_9d903bae-cb83-45eb-be7b-61d66ea1446d.645a60038c0bf92d97fd092bf304f8a3.png?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/8f78a2df-b8f7-45be-9a2f-b001ac3bc077.00aeac4a453c745788ff1f5b83bc67c9.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/1baf6946-3781-4fd3-8817-9a996649d9e6.55efbbc31234348ec9a5211279bbdd7b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/2da52e60-baef-46fc-81f7-2608777ba1be.4427849cf16906926bde6ac32f445cb3.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/18b9a95a-b8d5-4d3a-b18a-71234749d558.22ed4913bdfff8fd2efdb265cf88b594.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/5e4b4716-2ca9-447c-8620-14a2bb8e4e41.b38f28ddbd03b85cacc3dd542d77f94e.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$399.94",
    "description_1_text": "The Apple MacBook Air \"Core i3\" 1.1 13-Inch (Retina, Scissor Keyboard, 2020) model features a 10-nm 10th Generation \"Ice Lake\" 1.1 GHz Intel \"Core i3\" processor (1000NG4) with two independent processor \"cores\" on a single chip, a 4 MB shared level 3 cache, 8 GB of onboard 3733 MHz LPDDR4X SDRAM, 256 GB of onboard PCIe-based flash storage, and an \"integrated\" Intel Iris Plus graphics processor that shares system memory. This all is tucked in a thin wedge-shaped aluminum case with an integrated 720p \"FaceTime HD\" webcam, Touch ID, a new backlit \"Magic Keyboard\" with a \"redesigned scissor mechanism\", a large \"Force Touch\" trackpad, and a high-resolution 13.3\" LED-backlit 2560x1600 (227 ppi) \"Retina\" display with True Tone technology. This all is tucked in a thin wedge-shaped aluminum case with an integrated 720p \"FaceTime HD\" webcam, Touch ID, a new backlit \"Magic Keyboard\" with a \"redesigned scissor mechanism\", a large \"Force Touch\" trackpad, and a high-resolution 13.3\" LED-backlit 2560x1600 (227 ppi) \"Retina\" display with True Tone technology.",
    "description_2_text": " Display: 13.3 inch LED-backlit \"Retina\" display with IPS and True Tone technology, Resolution: 2560 x 1600 pixel Internal Memory: 256GB, 8GB RAM Iris Plus - 10th Gen \"Intel Mobile Core i3 \"Ice Lake\" (I3-1000NG4) processor - Two Thunderbolt 3 ports (USB-C connector) - Pre-Installed MacOS: X 10.15.3 49.9-watt-hour lithium-polymer battery can provide up to 11 hours of \"wireless web\" and up to 12 hours of Apple TV app movie playback. Dimensions: .16-.63 x 11.97 x 8.36 in, Weight: 2.8 lbs. ",
    "reviews": [
      {
        "text": "We have no issue or complaints with this product. We saved a bundle, thanks Walmart!!",
        "rating": 5,
        "author": "biada",
        "date": ""
      },
      {
        "text": "I love it!!!",
        "rating": 5,
        "author": "Ingrid",
        "date": ""
      },
      {
        "text": "I did see some bad reviews of this seller but my computer came and works well, the battery seems to be fine and it came on time as well. It wasn't too safety packaged but it didn't come damaged in any way.",
        "rating": 5,
        "author": "Abby",
        "date": ""
      },
      {
        "text": "Getting Macs refurbished is a bit like Russian Roulette...you can luck into some really good items, but then you can end up with some really crappy ones. I have had both experiences, so I was not sure what to expect. There was a quality rating image on the product description page that showed the condition as \"excellent,\" and between that ant the price, caused me to take a leap of faith on this one. \n\nI received the MacBook Air and have been using it for almost a week and I am very satisfied with it for the most part. It came in excellent condition as stated. The box it came in protected it well, and it had very light signs of use on it. I cleaned it up a little and it looks almost brand new. It was important to me to get a 2020 MacBook Air because that one can be updated to the latest release of MacOS as opposed to previous versions which can only go up to Sonoma. I was able to upgrade this MacBook Air with no issues.\n\nIt works great! I was most worried about the battery, as most refurbished MacBooks have worn-down or bad batteries, but this laptop has a battery reported as normal by MacOS. It holds a charge for a very long time and I can use it on the battery with no issues. It also comes with a new condition USB-C charger that works fine. For the price, this was a really good deal...except for one issue.\n\nThe listing states that this is a MacBook with 256GB of storage space, which is great, and part of the reason that I got this particular laptop. But when it arrived, I found out it was only 128GB of storage. That is not awful, as all of my most important apps fit on the hard drive and I keep my documents in the cloud so I save space. Still, that is only 1/2 of the advertised capacity. \n\nWeighing everything, given the fact the laptop was fine everywhere else, I decided to see if I could reach out and get a partial refund to compensate me for the fact that I did not get the advertised storage. I did not want to have to go through the full refund process only to have to reorder a different laptop and potentially get one that had more storage but more issues, too. Walmart informed me that they could not do a partial refund, only a full refund and then I would need to reorder the laptop on my end. They did offer a discount if I went that route, but I did not want to send the one I had back.\n\nI reached out to the seller directly and have not heard anything back from them yet. Because the laptop I got is so good otherwise, I can work around the incorrect storage issue, but for another user that may have been a dealbreaker. So the shipping was fast, the laptop looks and runs great, but the incorrect storage detracts from my rating. Still, I cannot say the experience was a bad one this time around.",
        "rating": 4,
        "author": "mrsone",
        "date": ""
      },
      {
        "text": "Everything was good except the charger I was sent an old charger that did not work for the laptop %26 when I got the laptop it was dead but aside from that everything is good",
        "rating": 4,
        "author": "Nikki",
        "date": ""
      },
      {
        "text": "I like it, got it for a decent price. However I wasn't aware it had a glitch on the screen before I purchased it.",
        "rating": 3,
        "author": "Maud",
        "date": ""
      },
      {
        "text": "The laptop does not turn on.  I find myself having to troubleshoot before I can even use.  This is a very bad sign.  I've been charging it up and researching what I can do.  I may have to drive 100 miles to another state to have  the techs at the store help me.  I'm extremely disappointed.",
        "rating": 1,
        "author": "Laurie",
        "date": ""
      },
      {
        "text": "I've had it for less then a week and the screen has lines going through it already",
        "rating": 1,
        "author": "Madison",
        "date": ""
      },
      {
        "text": "the laptop has significant visible defects and works so bad. it's impossible to use it as it is very buggy.",
        "rating": 1,
        "author": "Yelyzaveta",
        "date": ""
      },
      {
        "text": "I ordered the MacBook and received a dell. What the heck? This isn't right at all",
        "rating": 1,
        "author": "Brianne",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Restored Apple iPhone 15 Plus - Fully Unlocked - 128 GB Pink (Refurbished)",
    "rating": "(4.1)",
    "review_count": "53 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Restored-Apple-iPhone-15-Plus-128GB-Unlocked-Pink_dfd2f498-ee48-460d-8527-8ba3cfa1a099.82f05d7f8bf60e240d939ae5b3c0ece3.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/4939705d-337a-4f16-9804-d77e95dd9b18.75d703a8cabc0193d68db955d134d5e8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/7118de38-1942-463b-9f25-196804e7da7c.664d54e87a8b8406c9d5251ba2656297.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/6743cdc6-2df9-49ab-808b-e7e8a6383740.ac8405496cca92169097816da73b3a55.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/0536037b-7b88-4c89-9a84-384f644871dd.0392bafc45be6655d46b254d3decd2f4.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$659.45",
    "description_1_text": "The iPhone 15 Plus has a 6.7 inch all-screen Super Retina XDR display with the Dynamic Island. The back is color-infrefurbished glass, and there is a contoured-edge anodized aluminum band around the frame. The side button is on the right side of the device. The 48MP Main camera shoots in super high-resolution. So it’s easier than ever to take standout photos with amazing detail. The 2x optical-quality Telephoto lets you frame the perfect close-up. The superfast chip powers advanced features like computational photography, fluid Dynamic Island transitions, and Voice Isolation for phone calls.",
    "description_2_text": " “Like-new” condition with very light micro-scratches, invisible at a distance of 8-12 inches (arm’s length). Battery life, if applicable, must be 80% of the “like-new” equivalent or higher. At least 90-days free returns.   DISPLAY Type Super Retina XDR OLED, HDR10 Size 6.7 inches Resolution 1290 x 2796 pixels. Ceramic Shield glass.iOS 17, upgradable to iOS 17.1.1Internal 128GB 6GB RAM CAMERA Dual 48 MP, f/1.6, 26mm (wide), 12 MP, f/2.4, 13mm (ultrawide) ",
    "reviews": [
      {
        "text": "Device arrived in a generic box in mint condition without a scratch on it even the screen was in perfect condition w/o a scratch on it. So happy with my purchase and definitely  would buy refurbished again! Kudos from the Sellers!",
        "rating": 5,
        "author": "RonnieR",
        "date": ""
      },
      {
        "text": "The Refurbished Iphone 15 Plus was shipped quickly, arrived in excellent condition and is working great. About $300 cheaper than a brand new one. A",
        "rating": 5,
        "author": "JoeJetson",
        "date": ""
      },
      {
        "text": "I had to return the phone because my provider didn't support E-sims phones.  Make sure your Provider supports E-sims phones!",
        "rating": 5,
        "author": "ADavis",
        "date": ""
      },
      {
        "text": "We got the shipment within 3 or 4 days of ordering. The phone works as if its new. Definitely worth it! Also came with a fast charger.",
        "rating": 5,
        "author": "Daniel",
        "date": ""
      },
      {
        "text": "Phone is  really nice battery was at a 100% and 0 cycles when received. My only issue was there was some light scratch on the screen that is no noticeable when screen is on. A",
        "rating": 4,
        "author": "Trevone",
        "date": ""
      },
      {
        "text": "It would be better if you canceled this transaction before withdrawing the money. It is very wrong. Now I will wait for ten days for you to refund me the money. Ten days later, when the money is refunded, I will go and buy the same phone from Amazon.",
        "rating": 1,
        "author": "faysalyildiz",
        "date": ""
      },
      {
        "text": "First it said it would arrive on a Monday that Monday came and it didn't it said delayed then two weeks past only update I got was a missing report now they haven't refunded me Walmart said blue bird would refund me but blue bird said Walmart would I'm losing my patience when the item obviously isn't going to arrive considering I went to the post office and she tracked it and said that the original post office never received it and they said that they did deliver to the post office so it's not there fault",
        "rating": 1,
        "author": "Hailey",
        "date": ""
      },
      {
        "text": "The phone never arrived, same as another review on here. Seller marked the package as missing with USPS and it stayed like that for days. Reached out to the seller and they wouldn't send a replacement as “their system does not allow” that. Since this has happened at least twice, makes me think the seller just writes “IPhone 15” in large letters across the package and makes it super obvious what's in the box for the postal workers to steal it. Very disappointed as this was a birthday present from my fiancé. Walmart is in the process of giving me a refund. Use caution when purchasing and don't purchase on a deadline in case the package never arrives…",
        "rating": 1,
        "author": null,
        "date": ""
      },
      {
        "text": "Absolutely awful experience. This seller is an absolute horror and they never even shipped my device that I payed 800 dollars for. Stay away 0/10 would never ever recommend.",
        "rating": 1,
        "author": "D",
        "date": ""
      },
      {
        "text": "I placed my order 2/6 and it was to be here 2/12 shipping from Miami FL to TN - about a 3 day transit. I have not received my order yet and it is 2/15.",
        "rating": 1,
        "author": "Traci",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Apple iPhone 15 Pro 128GB Black Titanium",
    "rating": "Not found",
    "review_count": "1,362 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Apple-iPhone-15-Pro-128GB-Black-Titanium_9f6f8b16-d4ea-4ecc-86f8-114386e6381e.88e5b55ab4cd0b6325266a880c055f64.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/Apple-iPhone-15-Pro-128GB-Black-Titanium_9f6f8b16-d4ea-4ecc-86f8-114386e6381e.88e5b55ab4cd0b6325266a880c055f64.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f8a9df9f-3438-4e7e-a286-c7c28b8d307d.eea8f3b1e40e7b9e853523f8825c9140.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/867423ff-542f-40be-b777-afa55e4ab08b.61d5069559bdd6ec7f169496787dfe57.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/98ebdfd0-4e19-48cb-bb74-60c67967359a.6ab7edb78add92d0f6c20184ab6120f4.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/d2e6bfef-54a3-4184-b173-3862cd0230c5.90023ae632b7ebc7dd023c1e02abe782.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Not found",
    "description_1_text": "iPhone 15 Pro. Forged in titanium and featuring the groundbreaking A17 Pro chip, a customizable Action button, and a more versatile Pro camera system.",
    "description_2_text": " FORGED IN TITANIUM - iPhone 15 Pro has a strong and light aerospace-grade titanium design with a textured matte-glass back. It also features a Ceramic Shield front that's tougher than any smartphone glass. And it's splash, water, and dust resistant. ADVANCED DISPLAY - The 6.1\" Super Retina XDR display with ProMotion ramps up refresh rates to 120Hz when you need exceptional graphics performance. Dynamic Island bubbles up alerts and Live Activities. Plus, with Always-On display, your Lock Screen stays glanceable, so you don't have to tap it to stay in the know. GAME-CHANGING A17 PRO CHIP - A Pro-class GPU makes mobile games feel so immersive, with rich environments and realistic characters. A17 Pro is also incredibly efficient and helps to deliver amazing all-day battery life. POWERFUL PRO CAMERA SYSTEM - Get incredible framing flexibility with 7 pro lenses. Capture super high-resolution photos with more color and detail using the 48MP Main camera. And take sharp close-ups from far away with the 3x Telephoto camera on iPhone 15 Pro. CUSTOMIZABLE ACTION BUTTON - Action button is a fast track to your favorite feature. Just set the one you want, like Silent mode, Camera, Voice Memo, Shortcut, and more. Then press and hold to launch the action. PRO CONNECTIVITY - The new USB-C connector lets you charge your Mac or iPad with the same cable you use to charge iPhone 15 Pro. With USB 3, you get a huge leap in data transfer speeds. And you can download files up to 2x faster using Wi-Fi 6E. VITAL SAFETY FEATURES - If your car breaks down when you're off the grid, you can get help with Roadside Assistance via satellite. And if you need emergency services and you don't have cell service or Wi-Fi, you can use Emergency SOS via satellite. With Crash Detection, iPhone can detect a severe car crash and call for help if you can't. DESIGNED TO MAKE A DIFFERENCE - iPhone comes with privacy protections that help keep you in control of your data. It's made from more recycled materials to minimize environmental impact. And it has built-in features that make iPhone more accessible to all. COMES WITH APPLECARE WARRANTY - Every iPhone comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ or AppleCare+ with Theft and Loss to extend your coverage. Legal iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max are splash, water, and dust resistant and were tested under controlled laboratory conditions with a rating of IP68 under IEC standard 60529 (maximum depth of 6 meters up to 30 minutes). Splash, water, and dust resistance are not permanent conditions. Resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage not covered under warranty. The display has rounded corners. When measured as a standard rectangle, the screen is 6.12 inches (iPhone 15 Pro, iPhone 15) or 6.69 inches (iPhone 15 Pro Max, iPhone 15 Plus) diagonally. Actual viewable area is less. Battery life varies by use and configuration. USB 3 cable with 10Gb/s speed required for up to 20x faster transfers on iPhone 15 Pro models. Wi-Fi 6E available in countries and regions where supported. Service is included for free for two years with the activation of any iPhone 15 model. Connection and response times vary based on location, site conditions, and other factors. iPhone 15 and iPhone 15 Pro can detect a severe car crash and call for help. Requires a cellular connection or Wi-Fi Calling. Height: 5.77 inches (146.6mm) Width: 2.78 inches (70.6mm) Depth: 0.32 inch (8.25mm) Weight: 6.60 ounces (187 grams) ",
    "reviews": [
      {
        "text": "The phone is awesome ! I love all the new new features and settings. I'm a simple type of person and I love it . I haven't even touched all that I can do or changed yet , not that it's hard it is very easy I'm just learning all I can do and changed . It truly is awesome .\nRussell",
        "rating": 5,
        "author": "Rjm48",
        "date": ""
      },
      {
        "text": "The iPhone 15 Pro offers all the bells and whistles of the prior iPhones. However it has beautiful pictures, top notch music abilities when paired with the AirPods as well as, upgraded Apple Music and Apple TV plus. I highly recommend this phone, to anybody, interested in the latest up to date apple technologies. I enjoyed this upgrade and it continues to delight me. Get the PRO version only.",
        "rating": 5,
        "author": "Roshan D",
        "date": ""
      },
      {
        "text": "iPhone 15 pro is a great phone",
        "rating": 5,
        "author": "Jeff Peace",
        "date": ""
      },
      {
        "text": "The iPhone 15 Pro Max is a real powerhouse. Its camera is next-level, capturing amazing shots. The big screen is perfect for watching and the battery lasts forever. If you want a top-tier phone that's stylish and high-performing, this is the one for you!",
        "rating": 5,
        "author": "Myrick",
        "date": ""
      },
      {
        "text": "Decent phone. Sometimes the software glitches and won't close out but it's not terrible",
        "rating": 5,
        "author": "Wiss",
        "date": ""
      },
      {
        "text": "After having the phone for a few days, I've noticed issues with using Apple Pay (Apple Wallet) to make purchases in stores. The phone consistently says to hold the phone near the reader when it's sitting on top of it. It fails to recognize the devices. I now have to go to Apple to figure out what the issue is with the phone (was told it could be a hardware issue). Other than this and the need to purchase all new accessories for the device, I love the upgrade.",
        "rating": 4,
        "author": "RaiChelle",
        "date": ""
      },
      {
        "text": "iPhone 15 pro is good, but the progress compared to model 13 is incremental. The company churns out new models without meaningful progress, requiring customers to pay for little value. I found that volunteering to be on the beta program turned out to be a fatal mistake because it would have required erasing and reinstalling all my applications and settings. It took me a long time on the phone with Apple experts to find a way around it. I should have been warned ahead of time.",
        "rating": 4,
        "author": "Longterm iPhone user",
        "date": ""
      },
      {
        "text": "New phones are always great but this one is pretty average. Nothing special. I don't like how, when you're on an app and answer a phone call, to hang up they have to or you have to exit out everything to get back to the phone screen to press that red button. Not impressed but I like the added storage space.",
        "rating": 4,
        "author": "Sarah884321",
        "date": ""
      },
      {
        "text": "Slow to charge. My two year old Samsung charges faster, also my screen freezes and will not return to desired orientation until I turn off or restart.",
        "rating": 3,
        "author": "CarolinaCutie",
        "date": ""
      },
      {
        "text": "I haven't got to use the phone yet cause it didn't come with a charge brick. They change the charger and the cord they supply is usbc on both sides instead of usb on one side so you would be able to use it at least. For a thousand dollars I would expect at least getting the hardware to be able to use the phone on a daily basis.",
        "rating": 1,
        "author": "NiccTheRuler",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Restored Apple iPhone 13 Pro Max - Fully Unlocked - 256 GB Sierra Blue (Refurbished)",
    "rating": "Not found",
    "review_count": "305 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Restored-Apple-iPhone-13-Pro-Max-Carrier-Unlocked-256GB-Sierra-Blue-Refurbished_725deb2a-6b3b-499d-ae29-19faecf1cc9a.015affca7360ef04cf94bd98d8766228.png?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/5e84c666-11fe-4f54-a04f-59b7a251be44.f7ab3e902bdf3b5926292180ed717b71.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/66d0a88b-8898-4ed0-abcb-7ea56bf1ab32.4fdde4fa1976a8caf2133f41adac0413.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/3919768c-9479-4a8e-80a3-80972fc4ab25.c0b3c7bff31385ef3dd17be4f7ccd730.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/27e239ee-dae7-4a6e-9b42-8d0726a3a959.df7b4d313fb2e318ba07bc58da9454b8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $634.99",
    "description_1_text": "• Fully Unlocked for GSM carriers (like AT&T And T-Mobile) and CDMA carriers (like Sprint And Verizon)• 6.7-inch Super Retina XDR display with ProMotion for a faster, more responsive feel• A15 Bionic chip for lightning-fast performance• 12MP TrueDepth front camera with Night mode, 4K Dolby Vision HDR recording• Up to 28 hours of video playback, the best battery life ever in an iPhone",
    "description_2_text": " “Like-new” condition with very light micro-scratches, invisible at a distance of 8-12 inches (arm’s length). Battery life, if applicable, must be 80% of the “like-new” equivalent or higher. At least 90-days free returns.  DISPLAY Type Super Retina XDR OLED, 120Hz, HDR10, Dolby Vision, 1000 nits (HBM), 1200 nits (peak)Size 6.7 inchesResolution 1284 x 2778 pixelsProtection Scratch-resistant ceramic glass, oleophobic coatingWide color gamutTrue-toneiOS 15, upgradable to iOS 15.4.1Internal 256GB 6GB RAM NVMeCAMERA Quad 12 MP, f/1.5, 26mm (wide), 12 MP, f/2.8, 77mm (telephoto), 12 MP, f/1.8, 13mm, 120Ã‹Âš (ultrawide),TOF 3D LiDAR scanner (depth) + TOF 3D LiDAR scanner (depth),SL 3D, (depth/biometrics sensor)WLAN Wi-Fi 802.11 a/b/g/n/ac/6, dual-band, hotspotBluetooth 5.0, A2DP, LEGPS Yes, with A-GPS, GLONASS, GALILEO, BDS, QZSSNFC Yes\"\"",
    "reviews": [
      {
        "text": "I was skeptical on buying another phone since the last one I got that was “refurbished” had lots of dings and dents on the side. This one tho ? Came in nearly perfect condition and I could barely see any dings or dents. It's not locked to a carrier, has the correct amount of storage, is the right color and phone model, everything looks good to me. I've only had it for like a couple of days so I'll write another one in a couple of months if anything changes",
        "rating": 5,
        "author": "Isabella",
        "date": ""
      },
      {
        "text": "I still have very good equipment, I had been told not to buy rebuilt equipment at Walmart. But I took a risk and I have a great phone at a bargain price.",
        "rating": 5,
        "author": "Efren",
        "date": ""
      },
      {
        "text": "it had a few marks and needed to be restored when received but it's been working perfectly fine since then",
        "rating": 4,
        "author": "towana",
        "date": ""
      },
      {
        "text": "phone was damaged",
        "rating": 3,
        "author": "latoya",
        "date": ""
      },
      {
        "text": "I demand a refund or replacement of my item. pay 690 for an iphone 13 pro max. and those scammers sent me a galaxy. I want to know how wlamart can help me or if my money is lost. I am going to take action on the matter and I will not rest. until they ban him for being a scammer.",
        "rating": 1,
        "author": "Brayden",
        "date": ""
      },
      {
        "text": "I bought this iPhone and as what I read on the description it's a refurbished phone, but it got minimum scratches and it's in very good conditions. Also, I read everything on to make sure that this phone had a cracked screen.  I get the iPhone and as soon as I open the package, I see that the phone has a cracked screen on top left corner, and I can tell you that it's going to spread. I sent a message to the seller, but I only got one reply to send pictures that it!",
        "rating": 1,
        "author": "ARIANA",
        "date": ""
      },
      {
        "text": "A lot of scratches on screen!!\nWhen I first saw it I thought screen needs to be cleaned but all are scratches.\nPlease stay away from this seller..",
        "rating": 1,
        "author": "Amir",
        "date": ""
      },
      {
        "text": "This product is not good I can not even see battery health",
        "rating": 1,
        "author": "Sai",
        "date": ""
      },
      {
        "text": "DO NOT BUY! Phone got here quick but it didn't come in the apple box and the screen was all scratched from both bottom side and some of the top right side. No luck getting in contact with seller.",
        "rating": 1,
        "author": "judith",
        "date": ""
      },
      {
        "text": "I only had this phone for maybe a month and I dropped it once. It had a substantially protective case on it, along with a screen protector and a camera protector. I noticed a crack where my camera is so I decided to take the case off and I saw that the entire phone was shattered on the backside including the camera area and the front of it was cracked too. Literally the whole back of the phone is crumbling off.  I believe this is because it's refurbished. When I received the phone it had fine line cracks all on the front of it. Very disappointing considering I paid $600 plus dollars. The phone looks like someone ran over it with no case on it.",
        "rating": 1,
        "author": "Ashley",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Straight Talk Apple iPhone 13, 128GB, Midnight - Prepaid Smartphone [Locked to Straight Talk]",
    "rating": "Not found",
    "review_count": "404 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Straight-Talk-Apple-iPhone-13-128GB-Midnight-Prepaid-Smartphone-Locked-to-Straight-Talk_f7161c65-ec39-4243-a60d-1773db232445.4668f08e8c56be046a8c3c7b636c2e3c.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/2c4ef6af-7d86-431c-9780-d2f81d90063f.9e818bf1dd015aa05635ba0da89d94d6.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/5d0fd714-3240-4497-b1dd-1da685a2b6f8.a1e9ff008e85d9e6f948f813c425619b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f14bcb90-a6bd-47a9-92c2-87b5d310d9c5.39f55c4e2281ecee6b205b829a1ac8b9.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/8d332c51-2bf8-4701-a499-f65c6d7cd51e.316fe6ae40fef39a3c2bf905b96015c2.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/fee4cdc1-a243-42cd-9968-792825b92921.6db1b9f53ab13f008440efe3205147ec.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$449.00",
    "description_1_text": "iPhone 13. Your new superpower. The iPhone 13 on Straight Talk is an all-out standout featuring the most advanced dual-camera system ever on iPhone and lightning-fast performance with the all-new A15 bionic chip. Shoot incredible low-light photos and videos with the new 12MP Wide & Ultra Wide cameras and make movie magic with Cinematic mode. With 128GB of storage space, you'll be able to download and store your favorite apps, games, music and more! Plus, the 6.1-inch Super Retina screen boasts an XDR display that's even brighter, so it's easier to see in full sunlight. ² Add in durability, power and speed with Ceramic Shield, a leap in battery life with up to 19 hours of video playback,³ and 5G capability for superfast downloads and high-quality streaming¹. Pair it with an unlimited talk, text & data plan on America's most reliable 5G† network without a contract from Straight Talk to keep you connected for less. Find the Apple iPhone 13 and Straight Talk plans online or in-store at your local Walmart.",
    "description_2_text": " Straigh Talk iPhone 13, 128GB, Midnight: Up to 19 hours of video playback³ 6.1-inch Super Retina XDR display² A15 Bionic chip for lightning-fast performance 5G for superfast downloads and high-quality streaming¹ iOS 15 packs new features to do more with iPhone than ever before⁵ 12MP TrueDepth front camera with Night mode, 4K Dolby Vision HDR recording Cinematic mode adds shallow depth of field and shifts focus automatically in your videos Advanced dual-camera system with 12MP Wide and Ultra Wide cameras; Photographic Styles, Smart HDR 4, Night mode, 4K Dolby Vision HDR recording Durable design with Ceramic Shield     Industry-leading IP68 water resistance⁴  Supports MagSafe accessories for easy attach and faster wireless charging⁶   Straight Talk utilizes the network with the most first place rankings in RootMetrics® 2H 2022 5G reliability assessments of 125 metros. Results may vary. Not an endorsement †5G access requires a 5G-capable device in a 5G coverage area Pair this phone with a best-selling no-contract Straight Talk plan Learn more about Straight Talk by visiting our Brand Page    ¹Data plan required. 5G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on 5G support, contact your carrier and see Apple website. ²The display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.06 inches diagonally. Actual viewable area is less.  ³Battery life varies by use and configuration. See Apple website for more information.  ⁴iPhone 13 is spill, splash, and dust resistant and was tested under controlled laboratory conditions with a rating of IP68 under IEC standard 60529. Spill, splash, and dust resistance are not permanent conditions. Resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage not covered under warranty.  ⁵Some features may not be available for all countries or all areas.  ⁶Accessories are sold separately.  ",
    "reviews": [
      {
        "text": "It arrived before the estimated date of delivery with everything intact including the iPhone itself, the Straight Talk activation kit, and a new charger. The setup was fairly simple, and I was able to transfer all of my information from my old iPhone to the new one!",
        "rating": 5,
        "author": "Breyuana",
        "date": ""
      },
      {
        "text": "I had my phone almost identically set up compared to my SE and got all of my photos within 10 minutes. I was able to even further streamline my set up process/keep my number by inserting my old SIM card. This phone's battery life and camera quality are massive improvements over the SE",
        "rating": 5,
        "author": "Blake",
        "date": ""
      },
      {
        "text": "I ordered my new phone and received in two days as promised. I upgraded from an 11 to this. I picked this one for the price and storage option and felt this was a great deal. I am with straight talk and I always buy my new phones from the Walmart app.",
        "rating": 5,
        "author": "HappyShopper",
        "date": ""
      },
      {
        "text": "I love it I have no complaints no",
        "rating": 5,
        "author": "Makayla",
        "date": ""
      },
      {
        "text": "The phone is great, love the camera. Only had one major problem. . . they didnt scan thee phone at the warehouse so we couldn't activate the phone! After numerous calls to Straight Talk and Walmart.com it was suggested that we return the phone. When we took it to our local store they were able to do some magic on their end and fix the problem. But this was 3 days later, and such a headache for such a minor mistake at the WAREHOUSE!!!",
        "rating": 4,
        "author": "Brandy",
        "date": ""
      },
      {
        "text": "Some one who packaged and shipped out my package from Walmart stole the phone that was inside and just sent me the box. I am very upset and am hoping who did that is held accountable and for a replacement phone as I really was looking forward twords my new one.",
        "rating": 1,
        "author": "Mateo",
        "date": ""
      },
      {
        "text": "The phone I received from Walmart.com was NOT scanned, so I was not able to activate it.  I had to go to a local Walmart, they had to refund my money and thankfully they had another phone there for me to purchase.  The Manager said that this happens ALL the time on Walmart.com.  This certainly is costing Walmart money since now I have returned a brand new phone that was opened and it can now only be re-sold as a used phone for a reduced cost.   I see other reviews where the exact same thing happened.  What a pain for customers! I will never order again.",
        "rating": 1,
        "author": "kimberly",
        "date": ""
      },
      {
        "text": "This phone was \"not scanned before it left the warehouse\". This is what I was told when I attempted to activate the phone. I've had Straight Talk for years and have bought phones online in the past with no problems, until now. After three frustrating days and numerous phone calls, a representative told me to take it to a Walmart store and have them scan it, then it can be found in the system and activated. I didn't see how that would work as the phone was not FROM the store, if you understand how their inventory works, but it was worth a try. Luckily this phone model was in their system. They processed a refund for the phone, put the money on a gift card, and resold it to me, this process of course included scanning the bar code of the new phone, and, there you go, it was now able to be found by Straight Talk when I called to activate it, so it does now work. This whole process was aggravating, stressful and completely ridiculous. Absolutely inexcusable that a phone, which by the way, claimed to be 'locked to Straight Talk' both on the website AND the material that came with the phone, could not be added to the advertised carrier without jumping through many, many hoops. Crazy! I will never buy another phone online. The phone itself is fine, but the whole customer experience was a -10.",
        "rating": 1,
        "author": "Annie",
        "date": ""
      },
      {
        "text": "BUYER BEWARE!!! The phone comes unscanned and is an automatic brick. Sim wont activate and customer service said Walmart store would do it. Walmart refused and said id have to return. 480$  tied up and a week waiting on a phone that would lever work.",
        "rating": 1,
        "author": "Hunter",
        "date": ""
      },
      {
        "text": "I can't transfer my straight talk service onto this phone because they did not scan it. I don't understand how they can sell a phone for over $600 that I cannot use. This is disappointing. I will be returning it.",
        "rating": 1,
        "author": "Jennifer",
        "date": ""
      }
    ]
  },
  {
    "product_name": "Straight Talk Apple iPhone 12, 64GB, Black- Prepaid Smartphone [Locked to Straight Talk]",
    "rating": "(4.4)",
    "review_count": "1,779 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Straight-Talk-Apple-iPhone-12-64GB-Black-Prepaid-Smartphone-Locked-to-Straight-Talk_817dd9eb-dd04-4862-9fdf-97f30418c072.e23b9e6a3e0e65e662497506f851c37b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/6a15abaf-0fa0-4148-ad8f-1a72a1f1c529.d8f14570589bbfc14264eab67900dc04.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/66b2853b-6cb5-4f20-b73a-b60b39b6de44.6b3bf83a920058a47342318925f1dc2b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f7b7c2d9-9cbc-4e97-a10c-73c8d52b959c.6ef6fb8b0314c9c77864f1d5b4df8757.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/30fe18f0-c315-490d-952a-f386029f6329.9c665c11076bec419942cefb6410ac62.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/5d0fd714-3240-4497-b1dd-1da685a2b6f8.a1e9ff008e85d9e6f948f813c425619b.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $249.00",
    "description_1_text": "Welcome to the new era of iPhone. With the iPhone 12 in Black from Straight Talk, you can use the ultrafast 5G to download huge files on the go and stream HDR video anytime anywhere.1 Take it all in with the beautifully bright 6.1-inch Super Retina XDR display2 that's protected with Ceramic Shield with 4x better drop performance.3 Take stunning photos, even at night with incredible low-light photography with a new advanced dual-camera system. Edit photos, browse and multitask better than ever with the powerful A14 Bionic chip and the 4GB RAM Memory. You're covered wherever you go, thanks to coverage on the network America relies on with Straight Talk. Find your next phone and choose from a range of talk, text and data plans either online or by heading to your local Walmart.",
    "description_2_text": " 6.1-inch Super Retina XDR display2 Ceramic Shield, tougher than any smartphone glass 5G for superfast downloads and high-quality streaming1 A14 Bionic chip, the fastest chip ever in a smartphone 4GB RAM Memory Advanced dual-camera system with 12MP Ultra Wide and Wide cameras; Night mode, Deep Fusion, Smart HDR 3, Apple ProRAW,5 4K Dolby Vision HDR recording 12MP True Depth front camera with Night mode, 4K Dolby Vision HDR recording Industry-leading IP68 water resistance6 Supports Mag Safe accessories for easy attach and faster wireless charging4 iOS 14 with redesigned widgets on the Home screen, all-new App Library, App Clips, and more Straight Talk utilizes the network with the most first place rankings in RootMetrics® 1H 2023 5G reliability assessments of 125 metros. Results may vary. Not an endorsement †5G access requires a 5G-capable device in a 5G coverage area Pair this phone with a best-selling no-contract Straight Talk plan Learn more about Straight Talk by visiting our Brand Page        1Data plan required. 5G is available in select markets and through select carriers. Speeds vary based on site conditions and carrier. For details on 5G support, contact your carrier and see Apple website. 2The display has rounded corners. When measured as a rectangle, the screen is 6.06 inches diagonally. Actual viewable area is less. 3Claim based on iPhone 12 Ceramic Shield front compared with previous-generation iPhone. 4Accessories are sold separately. 5iPhone 12 is splash, water, and dust resistant and was tested under controlled laboratory conditions with a rating of IP68 under IEC standard 60529 (maximum depth of 6 meters up to 30 minutes). Splash, water, and dust resistance are not permanent conditions. Resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage not covered under warranty.  ",
    "reviews": [
      {
        "text": "Where do i even begin…\n\nBoy oh boy where do I even start, Dear David Milligan you genuinely the most beautiful amazing handsome intelligent man on this earth, the world with out would crumble and would be a very dark place. In the realm of OGP, one name shines bright, David Milligan.",
        "rating": 5,
        "author": "jake",
        "date": ""
      },
      {
        "text": "this is my 3rd straight talk phone I've purchased through Walmart %26 I would highly recommend. not sure why there are so many bad reviews but just purchase it! make sure if you're switching carriers to buy the SIM card as well. the iphone12 %26 greater have an eSIM but I've heard so many bad reviews about it, I would just go ahead and buy the $3 SIM card lol",
        "rating": 5,
        "author": "Sarah",
        "date": ""
      },
      {
        "text": "For the price, it was a very nice upgrade with majority of the features that the more expensive ones have but without going overboard and spending a bunch of money. So far I’m happy with the phone overall, and I would definitely buy it again and recommend to people. The camera as well as the extra features are amazing",
        "rating": 5,
        "author": "Kara",
        "date": ""
      },
      {
        "text": "I love everything about it. I had the XR for almost 3 years and just wanted to upgrade and wanted something better and this is my 2nd day of having this phone and so far so good no complaints. I really love the camera and how wide span the screen is.",
        "rating": 5,
        "author": "Anna",
        "date": ""
      },
      {
        "text": "I got this phone for my man’s Xmas present, great gift idea. Affordable %26 straight talk is super easy to work with.",
        "rating": 5,
        "author": "Sidney",
        "date": ""
      },
      {
        "text": "I love my refurbished Apple iPhone 12. When it same in the mail, I looked to be a new phone. I love the quality of the photos it takes. Setting it up was a breeze. I would recommend that if you are thinking about purchasing one of these phones, don't sleep on it, get it! Lord know I could not afford to buy one of these brand new, refurbished ones are just as GOOD!",
        "rating": 5,
        "author": "LaSonia Lamay",
        "date": ""
      },
      {
        "text": "DO NOT BUY THIS PHONE! I have been. StraightTalk subscriber for at least 10 years and have never had a problem with my service until I attempted to activate this phone. I got the runaround from the Customer Service « Management «  Team and after 7 days without anyone being able to get my new phone activated and no service, I just went back to my old SE. Do not waste your time or money.",
        "rating": 1,
        "author": "Cas",
        "date": ""
      },
      {
        "text": "I purchased this as a Christmas gift. Christmas was Monday and today is Saturday after Christmas. I’ve been trying all week to set this phone up. \nIt will not transfer my data and set up. On Friday (yesterday)I decided to return this phone that I purchased as a gift so I could purchase a different phone from Walmart.  A phone that would work. \nTo my dismay I was told that Walmart would not accept this item for return or exchange because it does not qualify as a returnable item under the Holiday exchange period.  \nI AM VERY UPSET.",
        "rating": 1,
        "author": "Donna",
        "date": ""
      },
      {
        "text": "I order my iPhone by pick up\nThere was nothing on line about having to open a NEW line to be able to take advantage of the $20 silver plan for a year with Straight Talk. I also noticed that it does say $20 in one place and $25 in another. Very confusing. I was told it was advertised on a really big sign in the store. I did not go into the store. I saw it online and order pick up. I'm upset that I missed out on a $300 savings because it wasn't properly worded on line.",
        "rating": 1,
        "author": "Merci",
        "date": ""
      },
      {
        "text": "BUYERS BEWARE! I ordered an Iphone 12 from Walmart.com.  Their carrier, FEDEX, delivered a box THAT WAS EMPTY! No phone was in the \"package\".  I contacted Walmart Customer Service.  They sent me an email saying that the box/package was delivered so they will not issue a credit for the phone (that WAS NOT in the box)! I am out $322.92. This deserves a 0 rating!",
        "rating": 1,
        "author": "47happy",
        "date": ""
      }
    ]
  },
  {
    "product_name": "PlayStation 5 Disc Console Slim",
    "rating": "Not found",
    "review_count": "1,720 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-PS5-Disc-Console-Slim_20785f28-4770-431e-a43f-626f79505c31.5804d76023f90d099f6d3ecd476948eb.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-PS5-Disc-Console-Slim_20785f28-4770-431e-a43f-626f79505c31.5804d76023f90d099f6d3ecd476948eb.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/a59fe458-33dd-4290-aa8a-d0d70b268d4c.c2eabd280159a50d02b1bf99e7a9418a.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/b900cc34-d0cc-45a6-8d1f-c19e8b8a64b1.0d0bf44c025f58f034a37dd966399cb8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/19a54acb-5ca5-4797-b760-87b19f2639db.f17f986e87fcfd5367730b02e7b6127f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/9ec4994d-651d-4e29-b661-f890bf288a3d.4c63e8bd3119f6af436955e4c150367c.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$499.00",
    "description_1_text": "Play Has No Limits PlayStation®5 The PS5 console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio*, and an all-new generation of incredible PlayStation® games. Lightning Speed Harness the power of a custom CPU, GPU, and SSD with Integrated I/O that rewrite the rules of what a PlayStation® console can do. Stunning Games Marvel at incredible graphics and experience new PS5 features.",
    "description_2_text": " Slim Design With PS5®, players get powerful gaming technology packed inside a sleek and compact console design. 1TB of Storage Keep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in.3 Ultra-High Speed SSD Maximize your play sessions with near instant load times for installed PS5® games. Integrated I/O The custom integration of the PS5® console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Ray Tracing Immerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5® games. 4K-TV Gaming Play your favorite PS5® games on your stunning 4K TV. Up to 120fps with 120Hz output Enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays. HDR Technology With an HDR TV, supported PS5® games display an unbelievably vibrant and lifelike range of colors. Tempest 3D AudioTech Immerse yourself in soundscapes where it feels as if the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech2 in supported games. Haptic Feedback Experience haptic feedback via the DualSense® wireless controller in select PS5® titles and feel the effects and impact of your in-game actions through dynamic sensory feedback. Adaptive Triggers Get to grips with immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5® games. Includes ASTRO’S Playroom Explore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense® wireless controller, in this game included for all PS5® console users. Backwards Compatibility & Game Boost The PS5® console can play over 4,000 PS4® games. With the Game Boost feature, you can even enjoy faster and smoother frame rates in some of the PS4® console’s greatest games. Vertical stand sold separately. *PS5® console (CFI-2000 model group – slim) 23D audio via built-in TV speakers or analog/USB stereo headphones. Set up and latest system software update required. 3A portion of the SSD is reserved for system software and other functions so the available SSD capacity may vary. 4Internet connection required to pair Disc Drive and PS5® console upon setup. © 2023 Sony Interactive Entertainment LLC. \"PlayStation\" and the \"PS Family logo” are registered trademarks and \"PS5\" is a trademark of Sony Interactive Entertainment Inc. ",
    "reviews": [
      {
        "text": "Well, honestly, I gotta say, from ordering the PS5 to having it shipped to the store so nothing would happen to it, I just hooked it up a couple of hours ago. I gotta say, PlayStation has come a long way. I am really digging the system, and to be honest, I just got the Xbox Series X in December. I can't really decide which is a better system, honestly, but as of now, I'm digging the voice feature on the controller very much. It is so nice; I don't have to buy a headset for the PlayStation. I can use the controller itself for communication. But not only that, I could go ahead and tell the PlayStation to shut down with the controller hands-free. I really love the operating system, and I feel it's a little bit more organized than the Xbox. As for the graphics, I don't know yet because I'm still downloading some games, so tomorrow, that's when I'll be able to really tell the difference. But regardless, I'm happy with the system and my experience with Walmart",
        "rating": 5,
        "author": "Thomas",
        "date": ""
      },
      {
        "text": "Thought it was going to be an impulse purchase I would regret but it’s ridiculously better than my old PS4 and you can instantly notice the difference just buy it",
        "rating": 5,
        "author": "Tyler",
        "date": ""
      },
      {
        "text": "Just received my package a little bit ago. Everything was sealed properly and not opened. Just started setting it up now and runs good.",
        "rating": 5,
        "author": "Luke",
        "date": ""
      },
      {
        "text": "My PS4 did a System Update of the New 11.25 and it BRICKED! White light of Death, so instead of buying a New or Used or Refurbished Ps4, i thought the New PS5 slim would now become my NEW PS4 console.  Who's to say this update won't BRICK the NEW one.",
        "rating": 5,
        "author": "Jason",
        "date": ""
      },
      {
        "text": "I bought my husband a PS5 because he's been working so hard to provide for us and our dog on the way to pick it up he guessed what it was but didn't believe it when he got it opened he was so grateful and happy he's downloaded several games and has had no issues with gameplay or anything of the sorts everything runs well and plastic is very durable our roommates dog ran through the charging cable and pulled the PlayStation out from where we set it up one of the panels popped off but snapped right back in no issues with it at all overall my husband loves this and recommends to anyone considering purchasing",
        "rating": 5,
        "author": "Savannah",
        "date": ""
      },
      {
        "text": "Much like Nintendo, there are games that only PlayStation has, unless youre willing to wait for the rare/occasional PC release. I own all systems, but PlayStation has the ecosystem that enjoy the most. Go where your friends and the games are. For me, its with Sony.",
        "rating": 5,
        "author": "Jordan",
        "date": ""
      },
      {
        "text": "My 3 star rating reflects my opinion more on our local Walmart than it actually does the PS5 system itself. I would give the system a 5 out of 5 stars, but our local Walmart gave me a box that was opened and someone attempted to reseal it. At first glance everything appeared there, and hooking the system up everything worked as it should. But afterward we found out the horizontal stands were missing, and after checking the box and packing 4 times there were no signs of them. Our local Walmart has really gone down hill in quality and this will be my last electronics purchase there.",
        "rating": 3,
        "author": "Michael",
        "date": ""
      },
      {
        "text": "I get home and pull it out the box just for it to be a used ps5 covered in some dried up liquid and scuff marks. Plugged it in and it won’t even turn on! Thanks for wasting my time and money Walmart!!",
        "rating": 1,
        "author": "Grant",
        "date": ""
      },
      {
        "text": "I never received my package from this shipper, FedEx and this shipper were no help what so ever. Bought this package a month ago form a state away and never got it. Walmart handled it 1000/10 gave a full refund and were very kind. So be careful and wary it might not happen to anyone else but just be wary. This was my experience with this brand or company or whatever it was.",
        "rating": 1,
        "author": "Rickk",
        "date": ""
      },
      {
        "text": "Will never order with this company again! Expensive item no signature, was supposed to be delivered on saturday delayed until sunday and i didn't receive item. Now i have to file police report and try to get refund bcuz usps said it was delivered! $500 dollar item delivered by usps no signature needed.",
        "rating": 1,
        "author": "BIKAL",
        "date": ""
      }
    ]
  },
  {
    "product_name": "PlayStation 5 Digital Console Slim",
    "rating": "(4.7)",
    "review_count": "2,564 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-PS5-Digital-Console-Slim_b899d2cb-ffc4-4a8a-8c90-b3451407acb3.41717bf8a8607f0d224b6ce850e2da12.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-PS5-Digital-Console-Slim_b899d2cb-ffc4-4a8a-8c90-b3451407acb3.41717bf8a8607f0d224b6ce850e2da12.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/90c5bdfa-0eb9-4b09-924c-b3b239500299.70f3a9281885886e33e67ed205d9403a.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/98142935-eeba-4194-8c16-693dc2e7127b.d1665bb711b9d250f42b4385cffb4979.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/fad6c1c7-1f3c-4fa9-9610-fd248a36a426.ee7b02b90ba3a2a60e4932735cc9fadc.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/4b560e54-c9f9-4779-9668-a1c76fe4ec6b.d0eba5951d6bc29a130be5afa9612863.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$449.00",
    "description_1_text": "Play Has No Limits PlayStation®5 The PS5 console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio*, and an all-new generation of incredible PlayStation® games. Lightning Speed Harness the power of a custom CPU, GPU, and SSD with Integrated I/O that rewrite the rules of what a PlayStation® console can do. Stunning Games Marvel at incredible graphics and experience new PS5 features.",
    "description_2_text": " Slim Design With PS5®, players get powerful gaming technology packed inside a sleek and compact console design. 1TB of Storage Keep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in.3 Ultra-High Speed SSD Maximize your play sessions with near instant load times for installed PS5® games. Integrated I/O The custom integration of the PS5® console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Ray Tracing Immerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5® games. 4K-TV Gaming Play your favorite PS5® games on your stunning 4K TV. Up to 120fps with 120Hz output Enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays. HDR Technology With an HDR TV, supported PS5® games display an unbelievably vibrant and lifelike range of colors. Tempest 3D AudioTech Immerse yourself in soundscapes where it feels as if the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech2 in supported games. Haptic Feedback Experience haptic feedback via the DualSense® wireless controller in select PS5® titles and feel the effects and impact of your in-game actions through dynamic sensory feedback. Adaptive Triggers Get to grips with immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5® games. Includes ASTRO’S Playroom Explore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense® wireless controller, in this game included for all PS5® console users. Backwards Compatibility & Game Boost The PS5® console can play over 4,000 PS4® games. With the Game Boost feature, you can even enjoy faster and smoother frame rates in some of the PS4® console’s greatest games. Vertical stand sold separately. *PS5® console (CFI-2000 model group – slim) 23D audio via built-in TV speakers or analog/USB stereo headphones. Set up and latest system software update required. 3A portion of the SSD is reserved for system software and other functions so the available SSD capacity may vary. 4Internet connection required to pair Disc Drive and PS5® console upon setup. © 2023 Sony Interactive Entertainment LLC. \"PlayStation\" and the \"PS Family logo” are registered trademarks and \"PS5\" is a trademark of Sony Interactive Entertainment Inc. ",
    "reviews": [
      {
        "text": "This review is short because I am not reviewing the PlayStation itself. It works exactly as advertised and shown through various videos online. As for buying through this Walmart seller, I got exactly what I ordered and the box was discreet. The PS5 box was sealed and nothing inside indicated it had been opened before. Started with no trouble. I’m writing this a few days after setting it up and have no complaints. Shipping was suuuper quick! Only complaint is Sony not making this coming in multiple colors!",
        "rating": 5,
        "author": "Jace",
        "date": ""
      },
      {
        "text": "Ps5 came in one day ordered it yesterday and got it today around the same time i ordered it yesterday amazing time and delivery although the meat head driver put it by the wrong house still a success!!",
        "rating": 5,
        "author": "Bryan",
        "date": ""
      },
      {
        "text": "Now this goes for all consoles when you switch. Unless you had a PlayStation Account in the past WITH games your gonna have no games. So when you buy this make sure to get a game. Besides that good console. Compared to the OG PS5 it's way smaller but runs the same. Way more compact and good for a small desk.",
        "rating": 5,
        "author": "Darius",
        "date": ""
      },
      {
        "text": "I love this ps5, I added the disc player to it because I had a bunch of ps4 games and movies so adding the disc player was very easy to do, cost 70 extra to add it. Only thing I would say is I would get more memory space since this only came with 800 something GB. But I can add more memory internally of needed but it will cost about 300 for 4 TB’s",
        "rating": 5,
        "author": "Ashley",
        "date": ""
      },
      {
        "text": "Actually i dont know anything about gaming. I bought this for my son for his birthday. I looked on target and then Walmart and Walmart had it before target the one near me so I decided to order it. It was actually really nice cause it was ready like I said less than an hour.",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "I got the PS5 Slim due to me moving into a new place that was limited in space. I couldn't take my PC with me due limited desk/room space. With the trend to go digital in all things, I figured I wouldn't miss not having a disc drive. Plus, I didn't want to travel with a bunch of discs. There is not a thing I don't like about this console. I bought it at a nice discount that fit my budget. I know this isn't a technical review but I just want to say that you can't go wrong with a disc-less system.",
        "rating": 5,
        "author": "Jarvis",
        "date": ""
      },
      {
        "text": "When i received the playstation and took it out of the box the safety seal was broken, the top was open and it was damaged on the sides of the box. I'm hoping this item wasn't returned and works properly because I intend to give it as a gift. Walmart needs to make sure online shoppers aren't being shipped open items because we do have options to return the item and prefer not to have to be bothered with the hassle of standing in a long line to return something that should be sealed and unopened. Its an inconvenience and it defeats the purpose of online shopping. Something that cost almost 500 dollars should be sealed and new. I'm hoping this works because \nI don't want my child to be disappointed on Christmas Day. This seems to be an issue another shopper had as well. This will be my last large purchase from Walmart due to this disrespectful move on their behalf. Items shipped to customers need to be new unopened and sealed, not damaged on the box and opened. This was not damaged during transit. It was placed in the box like this.  I didn't pay for an open box item and should not have received it in that condition.",
        "rating": 1,
        "author": "Ro",
        "date": ""
      },
      {
        "text": "My package was suppose to come between 11am-3pm saturday and i never received but a representative told me that the driver said they asked the “customer” to verify their information and gave it to a young female. Me %26 my grandmother are the only ones that live in her home and neither of us received this package and in the picture i dont see a face or nothing even the clothes the individual is wearing is not mines %26 there hands are bigger than mines and they are darker than me. Walmart is very unprofessional and told me there is nothing they can do about it but i will sue you guys if im not accommodated i spend my money online shopping all the time and never have any issues i received all of my orders but this one no one in the neighborhood knows my information to verify anything and my grandma didnt know i ordered this package the least you guys can do is reship the item ATLEAST. How is it my fault i paid almost $500 for an order and you guys tell me there is nothing you can do but then when you get a lawsuit coming its a problem but next time tell your drivers to verify the information before handing a stranger my order %26 tell the truth and give me a description of who you guys gave the order to. Also showing photos because my hands are smaller than whoever this is and i have long small braids in my head with pink almond shaped nails.",
        "rating": 1,
        "author": "Tanayjsa",
        "date": ""
      },
      {
        "text": "I bought this Ps5 as a birthday gift for my son. He was having issues setting it up. Every time my son tried insert his new game into the ps5 it would not take it. Here this was a ps4 game already in it!!!!! I bought new and expected new. I will be contacting Walmart about this situation!!!!",
        "rating": 1,
        "author": "kh",
        "date": ""
      },
      {
        "text": "just stop working for no reason. I don't know if I received a dud or what or maybe the way Walmart packages and ships these items they just throw them in bags or boxes with no protection but it worked good for about 1 week and then just died on me now I'm having a hard time trying to get a replacement or refund.",
        "rating": 1,
        "author": "Michaelwasherr",
        "date": ""
      }
    ]
  },
  {
    "product_name": "PlayStation Portal Remote Player for PS5 Console",
    "rating": "(4.3)",
    "review_count": "1,615 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/PlayStation-Portal-Remote-Player-for-PS5-Console_a0af7ae4-2bf7-4e49-a5c7-26939b3e91d0.a94bca8df04fdc68fe213ba37d9245ca.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/9691b632-1152-4be4-a270-c7a91018d0fb.9361dfe9e14084ba1f2661c1b4cdee31.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/e3d7d6d9-32bf-43c9-bfd5-717fe56c0ce3.7a6174b03a1397327d08e902c7bf4a73.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/09844cd2-8b63-4e2f-a243-590d40b6f327.fd6d91cb0fbb25223f418169f1c2bc53.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/32d6cf40-cd11-4a88-9459-2996452b2550.37009188fcacc119bc119a33d836ebb7.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/e94c4a27-6894-4604-ab7e-e77ce58ee27a.ed8de2f9b03b4c41bfa3825fdc351f70.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$199.00",
    "description_1_text": "Play your PS5 console over your home Wi-Fi with console quality controls using PlayStation Portal? Remote Player.1 Experience the incredible immersion of DualSense wireless controller features like haptic feedback and adaptive triggers in supported games.4 Put your game collection on PS5 in the palm of your hand? PlayStation Portal? Remote Player can play compatible games you have installed on your console2 without needing to play on a TV.",
    "description_2_text": " Put Your PS5 in the Palm of Your Hand PlayStation Portal? Remote Player gives you access to the games on your PS5 over your home Wi-Fi,1 letting you jump right into gaming without needing to play on a TV. Play Your Game Collection PlayStation Portal? Remote Player can play compatible games you have installed on your PS5 console, including your favorite games for PS5 and PS4.2 Experience Breathtaking Immersion with DualSense Wireless Controller Features Feel the immersive power of haptic feedback and adaptive triggers in supported games.4 Responsive vibrations react to your in?game choices and simulate environmental factors. Dynamic resistance mimics the tension of interactions with in?game gear and objects in select PS5 games. Beautiful 8? LCD Screen Take in every exquisite detail of your favorite games as they come alive on a brightly lit and gorgeous full HD screen. 60fps Capable at 1080p Resolution PlayStation Portal? Remote Player can deliver silky smooth gameplay at up to 60fps with high image clarity on its 1080p resolution screen.3 Get Gaming Fast PlayStation Portal? Remote Player is a purpose-built device dedicated to delivering an incredible remote play experience. That means you can turn it on, press a button to connect to your PS5 console and get right to playing with remarkable speed. ",
    "reviews": [
      {
        "text": "yes you can use your phone for remote play but it just feels clunky and odd.  using the portal feels like using a ps5. the lag is Noticable on occasion.  i wouldn't use it to play COD or TEKKEN but i would use it for god of war and 1 player games similar to that.  it's it still worth 199?!? 150 would be the sweet spot,  but it's Sony being Sony.",
        "rating": 5,
        "author": "cornell",
        "date": ""
      },
      {
        "text": "I like the PS5 Portal. Fortnite is playable but it dose struggle a little. I altrady knew that though. Now i can play my PS5 even when my wife is watching TV.\nQuality is excellent. The screen is clear and bright and battery life is just as i would expect.",
        "rating": 5,
        "author": "MrGadgetfixer",
        "date": ""
      },
      {
        "text": "Was able to get this through the HotStocks App just in time for Valentine's Day. Only concern is they didn't put any padding between the shipment box and the box for the portal itself and there was a considerable amount of room between them. And the Portal itself wasn't padded either, which is odd considering how much I paid for shipping.",
        "rating": 5,
        "author": "XxXSLAYERXxX",
        "date": ""
      },
      {
        "text": "Overall it is handy but not perfect. The joysticks make ticking/clicking sounds in a certain direction, something is hitting inside. Adaptive triggers make super loud vibrating noise but can be weakened/disabled in the settings.\nAlso even though I have a hardwired PS5 and have a high-end router nearby in a congestion-free channel, there is a minimal stutter in fast-moving scenes. Remote play on PC and other devices is always smooth, PS Portal is not when it should be.\nAll issues mentioned above are very common if you search online.\nI will be returning mine and then wait for SONY to fix these issues. My suggestion - ignore PS fanboys blindly buying this thing. Study your network settings and research the fixes for the issues mentioned before purchasing it.",
        "rating": 2,
        "author": "SonyFanboy",
        "date": ""
      },
      {
        "text": "You would think it will connect to a WiFi, no matter if it’s strong, it’s constantly disconnecting and connecting. It’s so frustrating. PS5 needs to make the device to connect to any strength. Or otherwise, the portal is useless. I would have given no stars; it doesn’t deserves any to begin with.",
        "rating": 1,
        "author": "Oscar",
        "date": ""
      },
      {
        "text": "The item itself was fine. \n\nHere was the issue I had with the seller. I bought the play station portal for over a triple markup with 2 day shipping on Dec 19. (I knew what I was paying for, which was to have the item by Christmas. It was my child’s Christmas gift. \n\nThe seller waited 3 days to ship the item. \nIt arrived 4 days after Christmas Dec 30.\n\nMultiple attempts to contact the seller were unsuccessful.\n\nThey should not be listed as a pro seller on this site. \n\nAgain,  no issues with the item, but I paid a HUGE premium markup to get it by Christmas. \n\nI should get that extra that I paid back, like I should only be charged retail price for the item but I doubly they will correct it %26 I’ll have to eat the cost .",
        "rating": 1,
        "author": "Queenierules",
        "date": ""
      },
      {
        "text": "I ordered this and recieved wrong item i chatted with an agent and was told \"KEEP WRONG ITEM REFUND WILL BE PROCESSED NOW\" i was lied to and now i jave to wait 14 business day because of walmarts errors. I asked to return wrong item instore and was denied that too. I asked for a $20 gift card for this SERIOUS INCONVIENCE AND WAS IGNORED!!!!! SO MUCH FOR MY CHILDS CHRISTMAS PRESENT THANKS WALMART FOR CRAPPY CUSTOMER SERVICE",
        "rating": 1,
        "author": "Sam",
        "date": ""
      },
      {
        "text": "Worst product ever, Get a switch or steam deck. This “console” doesn’t even connect to your ps5 it only turns it on that’s it. It will then tell you “failed to connect to PlayStation 5” I’ve tried restarting both the portal and ps5 and nothing works I’m very disappointed. Don’t trust the good reviews as I’m now sure they are either bots or trolls",
        "rating": 1,
        "author": "Mikitoba",
        "date": ""
      },
      {
        "text": "Don’t trust Walmart anymore my order never arrive and they haven’t don’t nothing to help me really disappointed about Walmart they really don’t support their customers or issues with orders I won’t buy my stuff from Walmart anymore is a waste of time and money",
        "rating": 1,
        "author": "ErikaJeannelle",
        "date": ""
      },
      {
        "text": "Contribution to the scalpers who buy all the new products just to resell them at double the price is ridiculous.  Only by not buying from these people will anything change.",
        "rating": 1,
        "author": "Damien",
        "date": ""
      }
    ]
  },
  {
    "product_name": "PlayStation 5 Slim Digital Edition – NBA 2K25 Bundle",
    "rating": "Not found",
    "review_count": "19 ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/PlayStation-5-Digital-Slim-Console_53c7bd41-eb79-4f02-8002-62a25f678197.1fa1b745a3dd04fd7306e9c1ae0800e0.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/c08209ad-930a-497c-a6e4-0f1c3b600e2a.5e72bf2f4af5f3d6e1823fa01b18874a.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/36125e05-39f9-48ad-8e24-8a14eee4255c.fa6ab039d70e6ca9b1f49d0386993b0f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/b31ea14f-46af-466b-bb3c-fe5dc3332645.e1afebdf5d3c2e8f00b899f70e74a1c5.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/38bdc542-e7da-45d5-83cc-ff02801ff04e.5feab8a0b43557904881067faf479811.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/ab6c1422-bde6-45a2-a7f1-e4a61aaf64db.abd87eabf83255844ec58878d268d9f8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "$499.00",
    "description_1_text": "Play Anywhere, Win Everywhere on NBA 2K25 with the PlayStation 5 Digital Edition – NBA 2K25 Bundle.  Play NBA 2K25 with PS5  innovations including 4K and HDR visuals*, haptic feedback with the DualSense wireless controller, and incredible speed with the PS5’s SSD.  * 4K and HDR require a 4K and HDR compatible TV or display.",
    "description_2_text": " Slim Design: With PS5 Digital Edition, players get powerful gaming technology packed inside a sleek and compact console design.  1TB of Storage: Keep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in.4 Ultra-High Speed SSD: Maximize your play sessions with near instant load times for installed PS5 games.  Integrated I/O: The custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Ray Tracing: Immerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games. 4K-TV Gaming: Play your favorite PS5 games on your stunning 4K TV. Up to 120fps with 120Hz output: Enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays. HDR Technology: With an HDR TV, supported PS5 games display an unbelievably vibrant and lifelike range of colors. Tempest 3D AudioTech: Immerse yourself in soundscapes where it feels as if the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech3 in supported games. Haptic Feedback: Experience haptic feedback via the DualSense wireless controller in select PS5 titles and feel the effects and impact of your in-game actions through dynamic sensory feedback. Adaptive Triggers: Get to grips with immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5 games. Includes ASTRO’S Playroom: Explore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense wireless controller, in this game included for all PS5® console users.  Backwards Compatibility & Game Boost: The PS5 console can play over 4,000 PS4 games. With the Game Boost feature, you can even enjoy faster and smoother frame rates in some of the PS4 console’s greatest games. Vertical stand sold separately. *PS5 Digital Edition (CFI-2000 model group – slim) 2Account for PlayStation™Network required. Full terms apply – playstation.com/PSNTerms. 33D audio via built-in TV speakers or analog/USB stereo headphones. Set up and latest system software update required. 4A portion of the SSD is reserved for system software and other functions so the available SSD capacity may vary. ",
    "reviews": [
      {
        "text": "I can't sleep lol love it !",
        "rating": 5,
        "author": "devon",
        "date": ""
      },
      {
        "text": "The delivery was on time smooth and I liked that I could track my package through their map",
        "rating": 5,
        "author": "Grezzette",
        "date": ""
      },
      {
        "text": "It's the best 2 k ever",
        "rating": 5,
        "author": "WalmartCustomer",
        "date": ""
      },
      {
        "text": "Very nice!!",
        "rating": 5,
        "author": "Derek",
        "date": ""
      },
      {
        "text": null,
        "rating": 5,
        "author": "Mike",
        "date": ""
      },
      {
        "text": null,
        "rating": 5,
        "author": "Gabriel",
        "date": ""
      },
      {
        "text": null,
        "rating": 5,
        "author": "christopher",
        "date": ""
      },
      {
        "text": "Too complicated",
        "rating": 2,
        "author": "Arthur",
        "date": ""
      },
      {
        "text": "I ordered 09/23 for my son birthday 09/25 the order was to be delivered with a signature on 09/24. I was told to be home and to sign for the package or present a code. The package was delivered without my knowledge and when I checked to see where it was it was already gone. I reached out to Walmart for a replacement and I was told since the delivery photo says delivered even without a signature it was delivered correctly! MIND YOU WERE TALKING ABOUT A PS5 BEING SET OUTSIDE!! I'm so so upset! Even if I got the refund today and reordered the system I wouldn't get it til maybe .. MAYBE Friday.",
        "rating": 1,
        "author": "Kris",
        "date": ""
      },
      {
        "text": "ordered the wrong Playstation 5 i need disk not disk free",
        "rating": 1,
        "author": "Carl",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2021 Apple 10.2-inch iPad Wi-Fi 64GB - Space Gray (9th Generation)",
    "rating": "Not found",
    "review_count": "17.3K ratings",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/8e5d6663-e373-4629-b803-e6fa6151bcfc.bc4f3d047381f57c84a87b83a177a599.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/63511221-7c5f-4524-9f7a-26d21683c824.6d64a6447dcb1e2adaf66b9ca0e72299.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/66a814c0-26db-411d-8f44-c972029015a8.1dcdfe75990a3a3d910293e43cd6269f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f5cfd46b-23b1-40cc-b07d-f570fb0cadea.246faa9dad284e77804acd019e5338a8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $224.00",
    "description_1_text": " Delightfully capable. Surprisingly affordable.   iPad. More function. More fun.  Powerful. Easy to use. Versatile. iPad has a beautiful 10.2-inch Retina display,1 powerful A13 Bionic chip, and an Ultra Wide front camera with Center Stage. Work, play, create, learn, stay connected, and more. All at an incredible value. ",
    "description_2_text": " 10.2-inch Retina display1 with True Tone  A13 Bionic chip with Neural Engine 8MP Wide back camera  12MP Ultra Wide front camera with Center Stage Touch ID for secure authentication and Apple Pay Lightning connector for charging and accessories  Go far with all-day battery life2 Up to 256GB of storage3 iPadOS 16 makes your iPad even more capable with powerful new productivity and collaboration features Works with Apple Pencil (1st generation) and Smart Keyboard    Stay connected with 802.11ac Wi-Fi Legal: Accessories sold separately and subject to availability. Compatibility varies by generation. Apps are available on the App Store. Title availability is subject to change. Third-party software sold separately.    1. Display size is measured diagonally.    2. Battery life varies by use and configuration. See apple.com/batteries for more information.    3. Available space is less and varies due to many factors. Storage capacity subject to change based on software version, settings, and iPad model. 1GB = 1 billion bytes; 1TB = 1 trillion bytes. Actual formatted capacity less.    ",
    "reviews": [
      {
        "text": "this was my first time ordering from walmart i was a lil skeptical because of the other reviews but i need it for college i got it the same day and it’s perfect i’ve now had it for 2 days and it’s perfect !!!! not laggy !! it’s good with roblox as well lol it’s perfect !",
        "rating": 5,
        "author": "Cyla",
        "date": ""
      },
      {
        "text": "2021 iPad is awesome and it came earlier than originally that it said it would be. I love it! I’d ordered one older and it didn’t compare to this Apple that I’d purchased. I would happily and DEFINITELY recommend it. Once again thank you  Apple! I also ordered a case to go with it.",
        "rating": 5,
        "author": "Shane",
        "date": ""
      },
      {
        "text": "In reading all the reviews I was a bit reluctant , wondered even if I might get a box of crackers inside my iPad box or something . I ordered this with my grocery delivery from my local Walmart and it came brand new in its packaging . I’ve had it for about a month now and it’s working perfectly fine !",
        "rating": 5,
        "author": "Eliana",
        "date": ""
      },
      {
        "text": "This is a great iPad. This is the first iPad I've ever purchased and I'm glad I went with this one. It's great for watching YouTube and stuff. Also great for reading books! It also has surprisingly good camera quality. The only con I have noticed so far is it can get a little laggy while playing big games like Hello Kitty Adventure Island and Call of Duty Warzone. It isn't like unplayable laggy, but it can be annoying. Overall I would say for the great price it is worth it!",
        "rating": 5,
        "author": "Angelina",
        "date": ""
      },
      {
        "text": "Purchased this as a Christmas Gift for my cousin. It was not only a welcomed surprise, it was needed to help us stay connected via FaceTime hep her manage her time and bills as she downloaded an interactive personal day planner, she can check her emails, and I think why she loves it the most get recipes to cook and try new dishes for her boys!!",
        "rating": 5,
        "author": "Musiclover",
        "date": ""
      },
      {
        "text": "I love it! I use it a lot for school work and everything was very easy to transfer over from my old one! I never had a problem with this one and it holds battery well just be careful when u close ur case it might not shut off and will die faster.",
        "rating": 5,
        "author": "Dereka",
        "date": ""
      },
      {
        "text": "Despite the reviews i was very very sketched at first it was delayed for shipping and i canceled it and decided to pick it up. GO GET IT FROM THE STORE least chance if any complications or scams",
        "rating": 5,
        "author": "Nia",
        "date": ""
      },
      {
        "text": "I went back and forth on buying an iPad and which model. I read reviews and gen 9 was highly rated and I must say so far it has not let me down! I’m in love with this devices and it does everything I need it to, so let’s hope I still feel this way months down the line!",
        "rating": 4,
        "author": "Gina",
        "date": ""
      },
      {
        "text": "Ordered this new iPad online. Box was empty when I got it. Walmart won’t refund me or send a new one after multiple attempts to get one. Now I’m out $271.10. DO NOT ORDER THIS ITEM ONLINE.",
        "rating": 1,
        "author": "Lisa",
        "date": ""
      },
      {
        "text": "My address is 2919 cross st Trlr B, and the ipad was delivered to 2919 cross st A. I asked the neighbor and they said they did not receive anything. So either they’re lying or something stole it.",
        "rating": 1,
        "author": "Eli",
        "date": ""
      }
    ]
  },
  {
    "product_name": "2021 Apple 10.2-inch iPad Wi-Fi 64GB - Space Gray (9th Generation)",
    "rating": "(4.7)",
    "review_count": "17,368 reviews",
    "all_image_urls": [
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/seo/2021-Apple-10-2-inch-iPad-Wi-Fi-64GB-Space-Gray-9th-Generation_611e6938-abd6-4af7-976b-682f5bb25ea0.27993cd01177da4dd6c82b6aea862d96.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/8e5d6663-e373-4629-b803-e6fa6151bcfc.bc4f3d047381f57c84a87b83a177a599.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/63511221-7c5f-4524-9f7a-26d21683c824.6d64a6447dcb1e2adaf66b9ca0e72299.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/66a814c0-26db-411d-8f44-c972029015a8.1dcdfe75990a3a3d910293e43cd6269f.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF",
      "https://i5.walmartimages.com/asr/f5cfd46b-23b1-40cc-b07d-f570fb0cadea.246faa9dad284e77804acd019e5338a8.jpeg?odnHeight=117&odnWidth=117&odnBg=FFFFFF"
    ],
    "price": "Now $224.00",
    "description_1_text": " Delightfully capable. Surprisingly affordable.   iPad. More function. More fun.  Powerful. Easy to use. Versatile. iPad has a beautiful 10.2-inch Retina display,1 powerful A13 Bionic chip, and an Ultra Wide front camera with Center Stage. Work, play, create, learn, stay connected, and more. All at an incredible value. ",
    "description_2_text": " 10.2-inch Retina display1 with True Tone  A13 Bionic chip with Neural Engine 8MP Wide back camera  12MP Ultra Wide front camera with Center Stage Touch ID for secure authentication and Apple Pay Lightning connector for charging and accessories  Go far with all-day battery life2 Up to 256GB of storage3 iPadOS 16 makes your iPad even more capable with powerful new productivity and collaboration features Works with Apple Pencil (1st generation) and Smart Keyboard    Stay connected with 802.11ac Wi-Fi Legal: Accessories sold separately and subject to availability. Compatibility varies by generation. Apps are available on the App Store. Title availability is subject to change. Third-party software sold separately.    1. Display size is measured diagonally.    2. Battery life varies by use and configuration. See apple.com/batteries for more information.    3. Available space is less and varies due to many factors. Storage capacity subject to change based on software version, settings, and iPad model. 1GB = 1 billion bytes; 1TB = 1 trillion bytes. Actual formatted capacity less.    ",
    "reviews": [
      {
        "text": "this was my first time ordering from walmart i was a lil skeptical because of the other reviews but i need it for college i got it the same day and it’s perfect i’ve now had it for 2 days and it’s perfect !!!! not laggy !! it’s good with roblox as well lol it’s perfect !",
        "rating": 5,
        "author": "Cyla",
        "date": ""
      },
      {
        "text": "In reading all the reviews I was a bit reluctant , wondered even if I might get a box of crackers inside my iPad box or something . I ordered this with my grocery delivery from my local Walmart and it came brand new in its packaging . I’ve had it for about a month now and it’s working perfectly fine !",
        "rating": 5,
        "author": "Eliana",
        "date": ""
      },
      {
        "text": "This is a great iPad. This is the first iPad I've ever purchased and I'm glad I went with this one. It's great for watching YouTube and stuff. Also great for reading books! It also has surprisingly good camera quality. The only con I have noticed so far is it can get a little laggy while playing big games like Hello Kitty Adventure Island and Call of Duty Warzone. It isn't like unplayable laggy, but it can be annoying. Overall I would say for the great price it is worth it!",
        "rating": 5,
        "author": "Angelina",
        "date": ""
      },
      {
        "text": "2021 iPad is awesome and it came earlier than originally that it said it would be. I love it! I’d ordered one older and it didn’t compare to this Apple that I’d purchased. I would happily and DEFINITELY recommend it. Once again thank you  Apple! I also ordered a case to go with it.",
        "rating": 5,
        "author": "Shane",
        "date": ""
      },
      {
        "text": "Purchased this as a Christmas Gift for my cousin. It was not only a welcomed surprise, it was needed to help us stay connected via FaceTime hep her manage her time and bills as she downloaded an interactive personal day planner, she can check her emails, and I think why she loves it the most get recipes to cook and try new dishes for her boys!!",
        "rating": 5,
        "author": "Musiclover",
        "date": ""
      },
      {
        "text": "Despite the reviews i was very very sketched at first it was delayed for shipping and i canceled it and decided to pick it up. GO GET IT FROM THE STORE least chance if any complications or scams",
        "rating": 5,
        "author": "Nia",
        "date": ""
      },
      {
        "text": "I love it! I use it a lot for school work and everything was very easy to transfer over from my old one! I never had a problem with this one and it holds battery well just be careful when u close ur case it might not shut off and will die faster.",
        "rating": 5,
        "author": "Dereka",
        "date": ""
      },
      {
        "text": "I went back and forth on buying an iPad and which model. I read reviews and gen 9 was highly rated and I must say so far it has not let me down! I’m in love with this devices and it does everything I need it to, so let’s hope I still feel this way months down the line!",
        "rating": 4,
        "author": "Gina",
        "date": ""
      },
      {
        "text": "Ordered this new iPad online. Box was empty when I got it. Walmart won’t refund me or send a new one after multiple attempts to get one. Now I’m out $271.10. DO NOT ORDER THIS ITEM ONLINE.",
        "rating": 1,
        "author": "Lisa",
        "date": ""
      },
      {
        "text": "My address is 2919 cross st Trlr B, and the ipad was delivered to 2919 cross st A. I asked the neighbor and they said they did not receive anything. So either they’re lying or something stole it.",
        "rating": 1,
        "author": "Eli",
        "date": ""
      }
    ]
  }
]